Repository: hxebolax/WASAPIRecording
Catalog: src/locales/*/LC_MESSAGES/app.po
Languages: de, fr, it, pt, tr

source: Mono
de: Affe
fr: Singe
pt: Macaco

source: Estéreo
de: Stereo
fr: Stéréo
it: Stereo
tr: Stereo

source: Mostrar aplicación
de: Anwendung anzeigen
fr: Afficher la demande
it: Mostra l'applicazione
pt: Mostrar aplicativo
tr: Uygulamayı göster

source: Cerrar
de: Schließen
fr: Fermer
it: Esci
pt: Fechar
tr: Kapat

source: Espere por favor... Procesando
de: Bitte warten... Verarbeitung
fr: Veuillez patienter... Traitement
it: Elaborazione in corso... Attendere prego...
pt: Por favor, aguarde... Processando
tr: Lütfen bekleyin... İşleniyor

source: Procesando
de: Verarbeitung
fr: Traitement
it: Elaborazione
pt: Processamento
tr: İşleniyor

source: WASAPIRecording ya se encuentra en ejecución. No se pueden tener dos instancias a la vez.
de: WASAPIRecording wird bereits ausgeführt. Es ist nicht möglich, zwei Instanzen gleichzeitig laufen zu lassen.
fr: WASAPIRecording est déjà en cours d'exécution. Il n'est pas possible d'avoir deux instances en même temps.
it: WASAPIRecording è già in esecuzione. Non è possibile tenere aperte due istanze contemporaneamente.
pt: O WASAPIRecording já está em execução. Não é possível ter duas instâncias ao mesmo tempo.
tr: WASAPIRecording zaten çalışıyor. Aynı anda iki pencere çalıştırılamaz.

source: Dispositivos
de: Geräte
fr: Rencontres positives
it: Dispositivi
tr: Cihazlar

source: Micrófon&o:
de: Mikrofon&o:
fr: Microphone&o :
it: Microfon&o:
pt: Microfone&o:
tr: Mikróf&on:

source: &Sistema (loopback):
de: &System (Loopback):
fr: &System (loopback) :
pt: &System (loopback):
tr: Sistem (&geri döngü):

source: &Refrescar Dispositivos
de: &Auffrischungsgeräte
fr: &Dispositifs de rafraîchissement
it: Aggio&rna dispositivi
pt: dispositivos &Refresh
tr: Cihazla&rı Yenile

source: Configuración de Grabación
de: Konfiguration der Aufzeichnung
fr: Configuration de l'enregistrement
it: Configurazione della registrazione
pt: Configuração de gravação
tr: Kayıt Ayarları

source: &Calidad (Hz):
de: &Qualität (Hz):
fr: &Qualité (Hz) :
it: &qualità (Hz):
pt: &Qualidade (Hz):
tr: &Kalite (Hz):

source: &Formato de salida:
de: &Ausgabeformat:
fr: &Format de sortie :
it: &formato di uscita:
pt: &Formato de saída:
tr: &Çıkış Biçimi:

source: &Bitrate MP3 (kbps):
fr: &Taux d'échantillonnage MP3 (kbps) :
tr: &Bit Hızı MP3 (kbps):

source: Modo Micrófon&o:
de: Mikrofon-Modus&o:
fr: Mode microphone&o :
it: Modalità microfon&o:
pt: Modo de microfone&o:
tr: Mikr&ofon Modu:

source: Modo &Sistema (loopback):
de: &System (Loopback) Modus:
fr: &Mode système (bouclage) :
it: Modalità &Sistema (loopback):
pt: Modo &System (loopback):
tr: &Sistem modu (geri döngü):

source: &Tamaño de buffer (frames):
de: puffergröße (Frames):
fr: taille de la mémoire tampon (frames) :
it: &Dimensione del buffer (frames):
pt: tamanho do buffer (quadros):
tr: Arabellek boyu&tu (çerçeveler):

source: Guardar archivos separados de micrófono &y sistema
de: Separate Mikrofon- und Systemdateien speichern
fr: Sauvegarde de fichiers séparés pour le microphone et le système
it: Salva separatamente i file del microfono e di sistema
pt: Salvar arquivos separados do microfone e do sistema
tr: Mikrofon ve sistem dosyalarını ayrı ayrı ka&ydet

source: &Volumen del Micrófono:
de: &Mikrofon-Lautstärke:
fr: volume du microphone :
it: &Volume del microfono:
pt: volume do microfone:
tr: Mikrofon Ses &Seviyesi:

source: &Volumen del Sistema:
de: &System Lautstärke:
fr: volume du système :
it: &Volume di sistema:
pt: volume do sistema:
tr: Sistem Ses Se&viyesi:

source: &Iniciar Grabación
de: &Aufnahme starten
fr: &Démarrer l'enregistrement
it: &Avvia la registrazione
pt: &Iniciar gravação
tr: Kayd&ı Başlat

source: &Pausar
de: &Pause
fr: &Pause
it: &Pausa
pt: &Pausa
tr: &Duraklat

source: &Detener Grabación
de: &Aufnahme stoppen
fr: &Arrêter l'enregistrement
it: Arre&sta la registrazione
pt: &Stop Recording (Parar gravação)
tr: Kaydı &Durdur

source: &Cancelar
de: &Abbrechen
fr: &Annuler
it: &Annulla
tr: İ&ptal

source: &Prueba de Audio
de: &Audio Test
fr: &Test audio
it: &Test audio
pt: teste de áudio
tr: Ses &Testi

source: &Menú
de: &Menü
fr: &Menu
it: &Menu
pt: &Menu
tr: &Menü

source: En espera (Usa {hk} para iniciar)
de: Standby (zum Starten {hk} verwenden)
fr: Veille (utiliser {hk} pour démarrer)
it: Standby (usa {hk} per avviare)
pt: Em espera (use {hk} para iniciar)
tr: Bekleniyor (Başlamak için {hk} tuşlarını kullanın)

source: Estado
de: Status
fr: État
it: Stato
tr: Durum

source: Hay una grabación en curso. ¿Desea detenerla y salir?
de: Eine Aufzeichnung läuft. Möchten Sie sie stoppen und beenden?
fr: Un enregistrement est en cours, voulez-vous l'arrêter et sortir ?
it: C'è una registrazione in corso. Vuoi interromperla e uscire?
pt: Uma gravação está em andamento. Deseja interrompê-la e sair?
tr: Bir kayıt devam ediyor, durdurup çıkmak istiyor musunuz?

source: Confirmar cierre
de: Bestätigung der Schließung
fr: Confirmer la fermeture
it: Conferma la chiusura
pt: Confirmar o fechamento
tr: Kapatmayı onaylayın

source: Por favor espere, finalizando conversión...
de: Bitte warten, Konvertierung wird abgeschlossen...
fr: Veuillez patienter, nous finalisons la conversion...
it: Attendere prego, sto finalizzando la conversione...
pt: Aguarde, estamos finalizando a conversão...
tr: Lütfen bekleyin, dönüştürme işlemi tamamlanıyor...

source: &Reanudar
de: &Lebenslauf
fr: &Carnet de notes
it: &Riprendi
pt: &Resumo
tr: Sü&rdür

source: Grabación cancelada. Se han eliminado los archivos.
de: Aufnahme abgebrochen. Die Dateien wurden gelöscht.
fr: Enregistrement annulé. Les fichiers ont été supprimés.
it: Registrazione annullata. I file sono stati eliminati.
pt: Gravação cancelada. Os arquivos foram excluídos.
tr: Kayıt iptal edildi. Dosyalar silindi.

source: Grabación
de: Aufnahme
fr: Enregistrement
it: Registrazione
pt: Gravação
tr: Kayıt

source: Por favor espere, convirtiendo a formato final...
de: Bitte warten, Konvertierung ins Endformat...
fr: Veuillez patienter, la conversion au format final est en cours...
it: Attendere prego, sto convertendo nel formato di uscita...
pt: Aguarde, a conversão para o formato final...
tr: Lütfen bekleyin, son biçime dönüştürülüyor...

source: Grabación completada. Archivo guardado como: {file_path}
de: Aufnahme abgeschlossen. Datei gespeichert unter: {file_path}
fr: Enregistrement terminé. Fichier sauvegardé sous : {file_path}
it: Registrazione completata. File salvato in: {file_path}
pt: Gravação concluída. Arquivo salvo como: {file_path}
tr: Kayıt tamamlandı. Dosya şu şekilde kaydedildi: {file_path}

source: Archivo separado de micrófono: {mic_path} Archivo separado de sistema: {system_path}
de: Separate Mikrofon-Datei: {mic_path} Getrennte Systemdatei: {system_path}
fr: Fichier microphone séparé : {mic_path} Fichier système séparé : {system_path}
it: File del microfono separato: {mic_path} File di sistema separato: {system_path}
pt: Arquivo de microfone separado: {mic_path} Arquivo de sistema separado: {system_path}
tr: Ayrı Mikrofon Dosyası: {mic_path} Ayrı Sistem Dosyası: {system_path}

source: ¿Desea abrir la carpeta de grabaciones?
de: möchten Sie den Ordner mit den Aufnahmen öffnen?
fr: voulez-vous ouvrir le dossier des enregistrements ?
it: Vuoi aprire la cartella delle registrazioni?
pt: deseja abrir a pasta de gravações?
tr: Kayıtlar klasörünü açmak istiyor musunuz?

source: Información
de: Informacion
fr: Informations
it: Informazioni
pt: Informação
tr: Bilgi

source: Alemán
de: Deutsch
fr: Allemand
it: Tedesco
pt: Alemão
tr: Almanca

source: Árabe
de: Arabisch
fr: Arabie
it: Arabo
tr: Arapça

source: Español
de: Spanisch
fr: Espagnol
it: Spagnolo
pt: Espanhol
tr: İspanyolca

source: Francés
de: Französisch
fr: Français
it: Francese
pt: Francês
tr: Fransızca

source: Inglés
de: Englisch
fr: Anglais
it: Inglese
pt: Inglês
tr: İngilizce

source: Italiano
de: Italienisch
fr: Italien
tr: İtalyanca

source: Portugués
de: Portugiesisch
fr: Portugais
it: Portoghese
pt: Português
tr: Portekizce

source: Serbio
fr: Serbe

source: Turco
de: Türkisch
fr: Turc
tr: Türkçe

source: Vietnamita
de: Vietnamesisch
fr: Vietnamien
tr: Vietnamca

source: Opciones
de: Optionen
fr: Options
it: Opzioni
pt: Opções
tr: Seçenekler

source: Buscar actualizaciones
de: Nach Aktualisierungen suchen
fr: Vérifier les mises à jour
it: Controlla gli aggiornamenti
pt: Verificar se há atualizações
tr: Güncellemeleri Denetle

source: Idioma
de: Sprache
fr: Langue
it: Lingua
tr: Diller

source: Abrir Grabaciones
de: Offene Aufzeichnungen
fr: Enregistrements libres
it: Apri registrazioni
pt: Gravações abertas
tr: Kayıtları Aç

source: &Manual de usuario
de: &Benutzerhandbuch
fr: & Manuel d'utilisation
it: &Manuale utente
pt: manual do usuário
tr: Kullanı&m kılavuzu

source: Acerca &de...
de: Über &de...
fr: À propos de &de...
it: Informazioni su...
pt: Sobre a &de...
tr: &Hakkında...

source: invítame a un &café si te gusta mi trabajo
de: laden Sie mich auf einen Kaffee ein, wenn Sie meine Arbeit mögen
fr: invitez-moi à prendre un café si vous aimez mon travail
it: invitami per un &caffè se ti piace il mio lavoro
pt: convide-me para um café se você gostar do meu trabalho
tr: i&şimi beğeniyorsan bana bir kahve ısmarla

source: Salir
de: Verlassen
fr: Quitter
it: Esci
pt: Sair
tr: Çık

source: &invítame a un café si te gusta mi trabajo
de: &laden Sie mich zu einem Kaffee ein, wenn Ihnen meine Arbeit gefällt
fr: &invitez-moi à prendre un café si vous aimez mon travail
it: &invitami a prendere un caffè se ti piace il mio lavoro
pt: convide-me para um café se gostar do meu trabalho
tr: i&şimi beğeniyorsan bana bir kahve ısmarla

source: Para aplicar el nuevo idioma se necesita reiniciar la aplicación. ¿Desea continuar?
de: Um die neue Sprache anzuwenden, müssen Sie die Anwendung neu starten. möchten Sie fortfahren?
fr: Pour appliquer la nouvelle langue, vous devez redémarrer l'application. voulez-vous continuer ?
it: Per applicare la nuova lingua è necessario riavviare l'applicazione. Vuoi continuare?
pt: Para aplicar o novo idioma, você precisa reiniciar o aplicativo. deseja continuar?
tr: Seçilen dilin aktif olması için uygulamayı yeniden başlatmanız gerekir. Devam etmek istiyor musunuz?

source: Confirmar cambio de idioma
de: Bestätigen Sie die Sprachänderung
fr: Confirmer le changement de langue
it: Conferma il cambio della lingua
pt: Confirmar a alteração do idioma
tr: Dil değişikliğini onaylayın

source: Grabación en pausa.
de: Aufnahme pausiert.
fr: Pause de l'enregistrement.
it: Registrazione in pausa.
pt: Gravação pausada.
tr: Kayıt duraklatıldı.

source: Grabando... (No hay hotkey de detener asignada)
de: Aufnahme... (Kein Stopp-Hotkey zugewiesen)
fr: Enregistrement... (Aucune touche de raccourci d'arrêt n'est affectée)
it: Registrazione... (Non è stato assegnato nessun tasto di scelta rapida per l'arresto)
pt: Gravando... (Nenhuma tecla de atalho de parada atribuída)
tr: Kaydediliyor... (Durdur kısayol tuşu atanmadı)

source: Grabando... (Usa {hk} para detener)
de: Aufnahme... (Mit {hk} wird die Aufnahme gestoppt)
fr: Enregistrement... (Utilisez {hk} pour arrêter)
it: Registrazione... (Utilizza {hk} per interrompere)
pt: Gravando... (Use {hk} para parar)
tr: Kaydediliyor... (Durdurmak için {hk} tuşunu kullanın)

source: En espera. Asigna teclas en Opciones o inicia manualmente.
de: Standby. Tasten in den Optionen zuweisen oder manuell starten.
fr: Veille. Attribuer des touches dans les options ou démarrer manuellement.
it: Standby. Assegna i tasti nelle Opzioni o avvia manualmente.
pt: Em espera. Atribua teclas em Options ou inicie manualmente.
tr: Bekleme modunda. Seçenekler iletişim kutusunda Kısayol tuşları belirleyin veya el ile başlatın.

source: No se pudo abrir el directorio de grabaciones: {error}
de: Aufnahmeverzeichnis konnte nicht geöffnet werden: {error} {error} {error} {error} {error} {error} {error} {error} {error} {error} [0
fr: Le répertoire d'enregistrement n'a pas pu être ouvert : {error} {error} {error} {error} {error} {error} {error} {error} {error} [0
it: Non è stato possibile aprire la cartella di registrazione: {error}
pt: Não foi possível abrir o diretório de gravação: {error} {error} {error} {error} {error} {error} {error} {error} {error} {error} {error} [0
tr: Kayıt dizini açılamadı: {error}

source: WASAPIRecording Versión: {} Creado por: {} Copyright © 2025 Traductores: 🇹🇷 Turco: Umut Korkmaz 🇸🇦 Árabe: moataz geba 🇮🇹 Italiano: Alessio Lenzi 🇻🇳 Vietnamita: Đào Đức Trung 🇷🇸 Serbio: Mila Kuran (IA)
fr: Enregistrement WASAPIR Version : {} Créé par : {} Copyright © 2025 Traducteurs : 🇹🇷 Turc : Umut Korkmaz 🇸🇦 Arabe : moataz geba 🇮🇹 Italien : Alessio Lenzi 🇻🇳 Vietnamien : Đào Đức Trung 🇷🇸 Serbe : Mila Kuran (IA)

source: Acerca de...
de: Über...
fr: À propos de...
it: Informazioni su...
pt: Sobre...
tr: Hakkında...

source: Manual de Uso
de: Benutzerhandbuch
fr: Manuel de l'utilisateur
it: Manuale utente
pt: Manual do usuário
tr: Kullanım Kılavuzu

source: &Manual de Uso:
de: &Benutzerhandbuch:
fr: &Manuel d'utilisation :
it: &Manuale utente:
tr: Kullanı&m Kılavuzu:

source: Aceptar
de: Akzeptieren
fr: Accepter
it: Ok
pt: Aceitar
tr: Tamam

source: Minimizar a la bandeja del sistema
de: In den Systembereich minimieren
fr: Minimiser au **barre d'état du système**
it: Riduci a icona nel System Tray
pt: Minimizar na bandeja do sistema
tr: Sistem tepsisinde simge durumuna küçült

source: Carpeta de grabaciones:
de: Ordner Aufzeichnungen:
fr: Dossier d'enregistrement :
it: Cartella delle registrazioni:
pt: Pasta de gravações:
tr: Kayıtlar klasörü:

source: Cambiar carpeta...
de: Ordner wechseln...
fr: Changer de dossier...
it: Cambia cartella...
pt: Alterar pasta...
tr: Klasörü değiştir...

source: Selecciona la carpeta donde se guardarán las grabaciones
de: Wählen Sie den Ordner, in dem die Aufnahmen gespeichert werden sollen
fr: Sélectionnez le dossier dans lequel les enregistrements seront sauvegardés
it: Seleziona la cartella dove salvare le registrazioni
pt: Selecione a pasta onde as gravações serão salvas
tr: Kayıtların saklanacağı klasörü seçin

source: Combinación para Iniciar Grabación:
de: Kombination zum Starten der Aufnahme:
fr: Pour démarrer l'enregistrement :
it: Combinazione per avviare la registrazione:
pt: Combinação para iniciar a gravação:
tr: Kaydı Başlatmak İçin Kombinasyon:

source: Capturar Hotkey Inicio
de: Capture Hotkey Home
fr: Capture Hotkey Home
it: Cattura Hotkey per Avvio
pt: Página inicial da tecla de atalho Capture
tr: Başlat Tuşunu Seç

source: Combinación para Detener Grabación:
de: Kombination zum Beenden der Aufnahme:
fr: Combinaison pour arrêter l'enregistrement :
it: Combinazione per arrestare la registrazione:
pt: Combinação para parar a gravação:
tr: Kaydı Durdurmak için Kombinasyon:

source: Capturar Hotkey Detener
de: Erfassen Hotkey Stop
fr: Arrêt des touches de raccourci de la capture
it: Cattura Hotkey per Arresto
pt: Capturar tecla de atalho Parar
tr: Durdur tuşunu seç

source: Combinación para Pausar/Reanudar:
de: Pause/Fortsetzen-Kombination:
fr: Combinaison pause/reprise :
it: Combinazione per Pausa/Riprendi:
pt: Combinação de pausa/retomada:
tr: Duraklat/Sürdür Kombinasyonu:

source: Capturar Hotkey Pausa
de: Erfassen Hotkey Pause
fr: Pause de la touche de raccourci de la capture
it: Cattura Hotkey per Pausa
pt: Pausa na tecla de atalho de captura
tr: Duraklat tuşunu seç

source: Combinación para Cancelar Grabación:
de: Kombination zum Abbrechen der Aufnahme:
fr: Combinaison pour annuler l'enregistrement :
it: Combinazione per annullare la registrazione:
pt: Combinação para cancelar a gravação:
tr: Kaydı İptal Et Kombinasyonu:

source: Capturar Hotkey Cancelar
de: Erfassen Hotkey Abbrechen
fr: Touche de raccourci de capture Annuler
it: Cattura Hotkey per Annulla
pt: Tecla de atalho Capturar Cancelar
tr: İptal et tuşunu seç

source: Esperando combinación...
de: Warten auf die Kombination...
fr: En attendant la combinaison...
it: In attesa della combinazione...
pt: Aguardando a combinação...
tr: Konbinasyon bekleniyor...

source: No puede asignar la misma combinación a más de una acción. Se revertirán los cambios.
de: Sie können dieselbe Kombination nicht mehr als einer Aktion zuordnen. Die Änderungen werden rückgängig gemacht.
fr: Vous ne pouvez pas attribuer la même combinaison à plus d'une action. Les modifications seront annulées.
it: Non è possibile assegnare la stessa combinazione a più di un'azione. Le modifiche saranno annullate.
pt: Não é possível atribuir a mesma combinação a mais de uma ação. As alterações serão revertidas.
tr: Aynı kombinasyonu birden fazla eyleme atayamazsınız. Değişiklikler geri alınacaktır.

source: Error de Hotkeys
de: Hotkey-Fehler
fr: Erreur de raccourci clavier
it: Errore nei tasti di scelta rapida
pt: Erro de tecla de atalho
tr: Kısayol Hatası

source: General
de: Allgemein
fr: Général
it: Generali
pt: Geral
tr: Genel

source: Teclado
de: Tastatur
fr: Clavier
it: Tastiera
tr: Klavye

source: Cancelar
de: Abbrechen
fr: Annuler
it: Annulla
tr: İptal

source: Prueba de Audio
de: Audio-Test
fr: Test audio
it: Test Audio
pt: Teste de áudio
tr: Ses Testi

source: &Información:
de: &Information:
fr: &Information :
it: &Informazioni:
pt: &Informações:
tr: B&ilgi:

source: &Selecciona qué archivo reproducir:
de: wählen Sie aus, welche Datei abgespielt werden soll:
fr: sélectionnez le fichier à lire :
it: &Seleziona il file da riprodurre:
pt: selecione o arquivo a ser reproduzido:
tr: Oynatılacak bir dosya &seçin:

source: Prueba micrófono
de: Mikrofon-Test
fr: Test du microphone
it: Test del microfono
pt: Teste de microfone
tr: Mikrofon testi

source: Prueba sistema
de: Systemprüfung
fr: Test du système
it: Test di sistema
pt: Teste do sistema
tr: Sistem testi

source: Ambos
de: Beide
fr: Les deux
it: Entrambi
tr: İkiside

source: &Detener
de: &Halt
fr: &Stop
it: &Arresta
pt: &Stop
tr: Durdur

source: &Cerrar
de: &Schließen
fr: &fermer
it: &Chiudi
pt: &Fechar
tr: &Kapat

source: Esta ventana realiza una prueba de grabación y reproducción con los mismos ajustes. Al pulsar 'Detener', podrás luego 'Reproducir'. Si guardas archivos separados, podrás elegir micrófono, sistema o ambos. No se puede cerrar con Alt+F4 ni con la X; sólo con 'Cerrar'.
de: In diesem Fenster wird eine Testaufnahme und -wiedergabe mit denselben Einstellungen durchgeführt. Wenn Sie auf "Stopp" drücken, können Sie anschließend "Abspielen". Wenn Sie separate Dateien speichern, können Sie zwischen Mikrofon, System oder beidem wählen. Es kann nicht mit Alt+F4 oder X geschlossen werden, sondern nur mit 'Schließen'.
fr: Cette fenêtre permet d'effectuer un test d'enregistrement et de lecture avec les mêmes paramètres. En appuyant sur "Stop", vous pouvez ensuite "Play". Si vous enregistrez des fichiers séparés, vous pouvez choisir le microphone, le système ou les deux. Cette fenêtre ne peut pas être fermée avec Alt+F4 ou X, mais uniquement avec "Fermer".
it: Questa finestra esegue una registrazione e una riproduzione di prova con le stesse impostazioni. Premendo "Arresta", è possibile poi "Riprodurre". Se si salvano file separati, si può scegliere il microfono, il sistema o entrambi. Non può essere chiusa con Alt+F4 o X, ma solo con "Chiudi".
pt: Essa janela executa um teste de gravação e reprodução com as mesmas configurações. Ao pressionar "Stop" (Parar), você pode então "Play" (Reproduzir). Se você salvar arquivos separados, poderá escolher o microfone, o sistema ou ambos. Ela não pode ser fechada com Alt+F4 ou X; somente com "Close".
tr: Bu pencere aynı ayarlarla bir test kaydı ve Oynatma işlemi gerçekleştirir. 'Durdur'a basarak daha sonra 'Oynat'ı seçebilirsiniz. Ayrı dosyalar kaydederseniz mikrofonu, sistemi veya her ikisini de seçebilirsiniz. Alt+F4 veya X ile kapatılamaz; yalnızca 'Kapat' tuşu ile kapatılabilir.

source: Reproducir
de: Wiedergeben
fr: Jouer
it: Riprodurre
pt: Reproduzir
tr: Oynat

source: Detener
de: Anhalten
fr: Arrêter
it: Arresta
pt: Parar
tr: Durdur

source: No se ha grabado nada aún.
de: Es wurde noch nichts aufgezeichnet.
fr: Rien n'a encore été enregistré.
it: Non è stato ancora registrato niente.
pt: Nada foi registrado ainda.
tr: Henüz hiçbir şey kaydedilmedi.

source: Aviso
de: Benachrichtigung
fr: Avis
it: Avviso
tr: Ayırt Et

source: No existe el archivo a reproducir
de: Die abzuspielende Datei existiert nicht
fr: Le fichier à lire n'existe pas
it: Il file da riprodurre non esiste
pt: O arquivo a ser reproduzido não existe
tr: Oynatılacak dosya mevcut değil

source: La grabación sigue en curso. ¿Deseas cancelar la prueba de sonido?
de: Die Aufnahme ist noch im Gange, möchten Sie den Soundcheck abbrechen?
fr: L'enregistrement est toujours en cours, souhaitez-vous annuler le soundcheck ?
it: La registrazione è ancora in corso. Vuoi annullare il test audio?
pt: A gravação ainda está em andamento, você deseja cancelar a passagem de som?
tr: Kayıt hâlâ devam ediyor. Ses testini iptal etmek istiyor musunuz?

source: Cancelar Prueba
de: Test abbrechen
fr: Annuler le test
it: Annulla Test
pt: Cancelar teste
tr: Testi İptal Et

source: Actualización
de: Update
fr: Mise à jour
it: Aggiornamento
pt: Atualização
tr: Güncelleme

source: Instalar
de: Installieren Sie
fr: Installer
it: Installa
tr: Kur

source: Se encontró una nueva versión: {0}. ¿Desea instalarla?
de: Es wurde eine neue Version gefunden: {0} Möchten Sie sie installieren?
fr: Une nouvelle version a été trouvée : {0} Voulez-vous l'installer ?
it: È disponibile una nuova versione: {0}. Vuoi installarla?
pt: Uma nova versão foi encontrada: {0} Deseja instalá-la?
tr: Yeni bir sürüm bulundu: {0}. Şimdi yüklemek ister misiniz?

source: No hay actualizaciones disponibles. Su aplicación está actualizada.
de: Es sind keine Aktualisierungen verfügbar. Ihre Anwendung ist auf dem neuesten Stand.
fr: Aucune mise à jour n'est disponible. Votre application est à jour.
it: Non sono disponibili aggiornamenti. L'applicazione è aggiornata.
pt: Não há atualizações disponíveis. Seu aplicativo está atualizado.
tr: Hiçbir güncelleme mevcut değil. Sürümünüz güncel.

source: No se pudo conectar al servidor. Verifique su conexión a Internet.
de: Es konnte keine Verbindung zum Server hergestellt werden. Überprüfen Sie Ihre Internetverbindung.
fr: Impossible de se connecter au serveur. Vérifiez votre connexion Internet.
it: Impossibile connettersi al server. Controlla la connessione a Internet.
pt: Não foi possível conectar-se ao servidor. Verifique sua conexão com a Internet.
tr: Sunucuya bağlanılamadı. İnternet bağlantınızı kontrol edin.

source: Error en la conexión segura (SSL). Por favor, revise la configuración de seguridad de su red.
de: Fehler bei der sicheren Verbindung (SSL). Bitte überprüfen Sie Ihre Netzwerksicherheitseinstellungen.
fr: Erreur dans la connexion sécurisée (SSL). Veuillez vérifier les paramètres de sécurité de votre réseau.
it: Errore nella connessione sicura (SSL). Controlla le impostazioni di sicurezza della rete.
pt: Erro na conexão segura (SSL). Verifique as configurações de segurança de sua rede.
tr: Güvenli bağlantı hatası (SSL). Lütfen ağ güvenliği ayarlarınızı gözden geçirin.

source: La conexión tardó demasiado tiempo. Intente nuevamente más tarde.
de: Die Verbindung hat zu lange gedauert. Bitte versuchen Sie es später noch einmal.
fr: La connexion a duré trop longtemps. Veuillez réessayer plus tard.
it: La connessione ha richiesto troppo tempo. Riprova più tardi.
pt: A conexão demorou muito tempo. Tente novamente mais tarde.
tr: Bağlantı çok uzun sürdü. Lütfen daha sonra tekrar deneyin.

source: Error de red desconocido: {0}
de: Unbekannter Netzwerkfehler: {0}
fr: Erreur de réseau inconnue : {0}
it: Errore di rete sconosciuto: {0}
pt: Erro de rede desconhecido: {0}
tr: Bilinmeyen ağ hatası: {0}
