Repository: hxebolax/WASAPIRecording
Catalog: src/locales/*/LC_MESSAGES/app.po
Languages: de, fr, it, pt, tr

source: Dispositivos actualizados correctamente.
de: Korrekt aktualisierte Geräte.
fr: Dispositifs correctement mis à jour.
it: Dispositivi aggiornati correttamente.
pt: Dispositivos atualizados corretamente.
tr: Cihaz listesi başarıyla yenilendi.

source: Error al refrescar dispositivos: {error}
de: Fehler beim Aktualisieren von Geräten: {error}
fr: Erreur lors de l'actualisation des périphériques : {error}
it: Errore durante l'aggiornamento dei dispositivi: {error}
pt: Erro ao atualizar dispositivos: {error}
tr: Cihazlar yenilenirken hata oluştu: {error}

source: No se detectó ningún micrófono. Por favor, conecta o habilita al menos un micrófono antes de continuar.
de: Es wurde kein Mikrofon erkannt. Bitte schließen Sie mindestens ein Mikrofon an oder aktivieren Sie es, bevor Sie fortfahren.
fr: Aucun microphone n'a été détecté. Veuillez connecter ou activer au moins un microphone avant de continuer.
it: Nessun microfono rilevato. Per favore, collega o attiva almeno un microfono prima di continuare.
tr: Mikrofon algılanmadı. Devam etmeden önce lütfen en az bir mikrofonu bağlayın veya etkinleştirin.

source: Error de Audio
de: Audio-Fehler
fr: Erreur audio
it: Errore audio
tr: Ses hatası

source: Se detectan micrófonos, pero no hay uno configurado como predeterminado. Por favor, configura un micrófono predeterminado en las opciones de sonido.
de: Mikrofone werden erkannt, aber es ist kein Mikrofon als Standard konfiguriert. Bitte stellen Sie ein Standardmikrofon in den Tonoptionen ein.
fr: Des microphones sont détectés, mais aucun n'est configuré par défaut. Veuillez définir un microphone par défaut dans les options sonores.
it: Sono stati rilevati microfoni, ma nessuno è impostato come predefinito. Per favore, imposta un microfono predefinito nelle opzioni audio.
tr: Mikrofonlar algılanıyor ancak hiçbiri varsayılan olarak ayarlanmamış. Lütfen ses seçeneklerinde varsayılan bir mikrofon ayarlayın.

source: Ocurrió un error intentando obtener el micrófono predeterminado. Por favor, revisa tus dispositivos de grabación.
de: Bei der Suche nach dem Standardmikrofon ist ein Fehler aufgetreten. Bitte überprüfen Sie Ihre Aufnahmegeräte.
fr: Une erreur s'est produite lors de l'obtention du microphone par défaut. Veuillez vérifier vos appareils d'enregistrement.
it: Si è verificato un errore durante l'individuazione del microfono predefinito. Per favore, controlla i tuoi dispositivi di registrazione.
tr: Varsayılan mikrofon algılanmaya çalışılırken bir hata oluştu. Lütfen kayıt cihazlarınızı kontrol edin.

source: No se detectó ningún altavoz o tarjeta de sonido habilitada. Revisa tu configuración de audio en el Panel de Control de Windows.
de: Es wurde kein aktivierter Lautsprecher oder keine Soundkarte erkannt. Überprüfen Sie Ihre Audioeinstellungen in der Windows-Systemsteuerung.
fr: Aucun haut-parleur ou carte son n'a été détecté. Vérifiez vos paramètres audio dans le panneau de configuration de Windows.
it: Non sono stati individuati altoparlanti o schede audio abilitate. Controlla le impostazioni audio nel Pannello di controllo di Windows.
tr: Etkinleştirilmiş hoparlör veya ses kartı algılanmadı. Windows Denetim Masası'ndaki ses ayarlarınızı kontrol edin.

source: Se detectan altavoces, pero no hay uno configurado como predeterminado. Por favor, configura un altavoz predeterminado en las opciones de sonido.
de: Lautsprecher werden erkannt, aber es ist kein Standardlautsprecher konfiguriert. Bitte stellen Sie einen Standardlautsprecher in den Soundoptionen ein.
fr: Les haut-parleurs sont détectés, mais aucun haut-parleur par défaut n'est configuré. Veuillez définir un haut-parleur par défaut dans les options sonores.
it: Sono stati rilevati altoparlanti, ma nessuno è impostato come predefinito. Per favore, imposta un altoparlante predefinito nelle opzioni audio.
tr: Hoparlörler algılanıyor ancak hiçbiri varsayılan olarak ayarlanmamış. Lütfen ses seçeneklerinde varsayılan bir hoparlör ayarlayın.

source: Ocurrió un error intentando obtener el altavoz/speaker predeterminado. Por favor, revisa tus dispositivos de reproducción.
de: Bei der Suche nach dem Standard-Lautsprecher/Lautsprecher ist ein Fehler aufgetreten. Bitte überprüfen Sie Ihre Wiedergabegeräte.
fr: Une erreur s'est produite lors de la recherche de l'enceinte/du haut-parleur par défaut. Veuillez vérifier vos appareils de lecture.
it: Si è verificato un errore durante l'individuazione dell'altoparlante/speaker predefinito. Per favore, controlla i tuoi dispositivi di riproduzione.
tr: Varsayılan hoparlör algılanmaya çalışılırken bir hata oluştu. Lütfen oynatma cihazlarınızı kontrol edin.

source: La combinación debe tener al menos 2 modificadores (Ctrl,Shift,Alt) y 1 tecla principal válida.
de: Die Kombination muss mindestens 2 Modifikatoren (Strg, Umschalt, Alt) und 1 gültigen Primärschlüssel enthalten.
fr: La combinaison doit avoir au moins 2 modificateurs (Ctrl,Shift,Alt) et 1 clé primaire valide.
it: La combinazione deve avere almeno 2 tasti modificatori (Ctrl, Shift, Alt) e un tasto principale valido.
pt: A combinação deve ter pelo menos 2 modificadores (Ctrl, Shift, Alt) e 1 chave primária válida.
tr: Kombinasyonun en az 2 değiştiriciye (Ctrl,Shift,Alt) ve 1 geçerli birincil anahtara sahip olması gerekir.

source: Error
de: Fehler
fr: Erreur
it: Errore
pt: Erro
tr: Hata

source: La combinación está en uso: {}
de: Die Kombination ist in Gebrauch: {}
fr: La combinaison est utilisée : {}
it: La combinazione è già in uso: {}
pt: A combinação está em uso: {}
tr: Kombinasyon kullanılıyor: {}
