Repository: hxebolax/WASAPIRecording
Catalog: src/locales/*/LC_MESSAGES/app.po
Languages: de, fr, it, pt, tr

source: 1. ¿Qué es WASAPIRecording? WASAPIRecording es una aplicación para Windows que te permite grabar el audio de tu micrófono y el audio del sistema (música, videollamadas, etc.) de forma simultánea. Puedes combinar ambos en un solo archivo o guardarlos por separado (uno para el micrófono y otro para el sonido del sistema). Además de las funciones básicas de grabación, WASAPIRecording incluye: • Un sistema de actualización automática que busca nuevas versiones en GitHub. • Un módulo para cambiar rápidamente el idioma de la interfaz y reiniciar la aplicación si es necesario. • Opciones de configuración para personalizar hotkeys y minimizar la ventana a la bandeja del sistema. 2. Requisitos • Windows 10 o superior (con WASAPI). • Permisos para ejecutar la aplicación (administrador no siempre es necesario, pero ayuda en casos de permisos restringidos). 3. Iniciar la Aplicación • Ejecuta el archivo o acceso directo llamado “WASAPIRecording”. • Se abrirá la ventana principal con controles para micrófono, sistema, formatos de audio, opciones de grabación, hotkeys y otros ajustes. 4. Configurar Dispositivos y Parámetros • **Micrófono**: Selecciona el micrófono que quieres usar. • **Sistema (loopback)**: Selecciona el dispositivo de tu PC que captura todo lo que suena en el sistema. • **Refrescar Dispositivos**: Si conectaste un nuevo dispositivo y no aparece en la lista, haz clic para actualizar. • **Calidad (Hz)**: Frecuencia de muestreo (22050, 44100 o 48000). A mayor valor, mayor calidad y tamaño de archivo. • **Formato de Salida**: WAV, MP3, FLAC, OGG o AIFF. • **Bitrate MP3**: Solo aparece si eliges MP3; ajusta la calidad de compresión. • **Modo de grabación (Mono o Estéreo)**: Define la forma en que se guardarán los canales (2 canales en estéreo o ambos canales centrados si es mono). • **Buffer (frames)**: Tamaño de bloque de audio que se procesa en cada ciclo de grabación. • **Guardar archivos separados**: Si lo marcas, además del archivo “combinado”, la app guardará otros dos archivos (uno solo con el micrófono y otro con el sistema). 5. Ajustar Volúmenes • **Volumen del Micrófono**: Usa el deslizador para subir/bajar la ganancia del micrófono. • **Volumen del Sistema**: Ajusta la ganancia de los sonidos del PC que quieras grabar. 6. Iniciar y Detener la Grabación • Pulsa **Iniciar Grabación** (o la hotkey global “Ctrl + Shift + F1” por defecto). El estado mostrará “Grabando…”. • Para **detener**, haz clic en **Detener Grabación** (o usa “Ctrl + Shift + F2”). • Si elegiste MP3, FLAC, OGG o AIFF, la app convertirá el archivo final tras la grabación, mostrando un diálogo de “Por favor espere…” hasta que termine. • Al finalizar, se mostrará un aviso con la ruta de los archivos generados. Si habilitaste la opción de “Abrir carpeta de grabaciones al terminar” (o respondiste “Sí” en la ventana emergente), se abrirá directamente la carpeta que contiene los archivos. 7. Dónde se Guardan las Grabaciones • Por defecto, en la carpeta “recording” dentro del directorio de la aplicación. • Puedes cambiar la carpeta de grabaciones en “Menú > Opciones > General > Carpeta de grabaciones”. • Para abrir la carpeta desde la aplicación, haz clic en “Menú > Abrir Grabaciones”. 8. Opciones y Menú En la ventana principal, verás un botón **Menú** que da acceso a: • **Acerca de…**: Muestra la versión actual de WASAPIRecording y el nombre del creador. • **Abrir Grabaciones**: Abre la carpeta donde se almacenan los archivos grabados. • **Idioma**: Te permite cambiar el idioma de la interfaz (es, en, it, fr, etc.). El cambio se aplica tras reiniciar la app. • **Buscar actualizaciones**: Comprueba si hay una nueva versión de la aplicación en GitHub. Si existe, podrás descargar e instalar la nueva versión, y luego reiniciar la app para actualizarte sin perder tus configuraciones. • **invítame a un café si te gusta mi trabajo**: Te redirige a una página de donación (por ejemplo, PayPal). Además, dentro del **Menú**, encontrarás: • **Opciones**: - **General**: Incluye la casilla “Minimizar a la bandeja del sistema” y la posibilidad de cambiar la carpeta de grabaciones. - **Teclado**: Permite personalizar los atajos globales para iniciar, detener, pausar y cancelar la grabación. También se muestra aquí si un atajo queda “Sin asignar” o si hay conflicto con otra acción. 9. Prueba de Audio • El botón **Prueba de Audio** abre un diálogo especial para grabar unos segundos de muestra y reproducirlos de inmediato. • Este diálogo aparece siempre en primer plano y **no** se puede cerrar con la “X” ni con Alt+F4; solo con el botón “Cerrar”. • Primero, comienza la grabación de prueba con el botón “Detener” (que sirve para finalizar la pequeña grabación). • Después, el mismo botón se transforma en “Reproducir”, para escuchar lo grabado. • Si marcaste “Guardar archivos separados”, podrás elegir reproducir solo el micrófono, solo el sistema o ambos. • Al cerrar el diálogo, los archivos temporales se borran, perfecto para verificar que todo suena bien antes de hacer una grabación definitiva. 10. Atajos de Teclado **Atajos Globales** (por defecto, personalizables en “Opciones > Teclado”): • Iniciar Grabación: **Ctrl + Shift + F1** • Detener Grabación: **Ctrl + Shift + F2** • Pausar/Reanudar Grabación: **Ctrl + Shift + F3** • Cancelar Grabación: **Ctrl + Shift + F4** **Atajos dentro de la interfaz** (con la tecla Alt, pueden variar según el idioma): • Micrófono: **Alt + O** • Sistema (loopback): **Alt + S** • Refrescar Dispositivos: **Alt + R** • Calidad (Hz): **Alt + C** • Formato de salida: **Alt + F** • Bitrate MP3 (kbps): **Alt + B** • Modo Micrófono: **Alt + O** • Modo Sistema (loopback): **Alt + S** • Tamaño de buffer (frames): **Alt + T** • Guardar archivos separados: **Alt + Y** • Volumen del Micrófono: **Alt + V** • Volumen del Sistema: **Alt + V** • Iniciar Grabación: **Alt + I** • Detener Grabación: **Alt + D** • Prueba de Audio: **Alt + P** • Menú: **Alt + M** • Cerrar (en algunos diálogos): **Alt + C** en algunos idiomas puede variar o usarse otras teclas dependiendo de la traducción. 11. Minimizar a la Bandeja • Si activas “Minimizar a la bandeja” en “Menú > Opciones > General”, al pulsar el botón de minimizar (esquina superior derecha de la ventana), la aplicación se ocultará de la barra de tareas y aparecerá un ícono en la bandeja del sistema (cerca del reloj). • Al hacer doble clic en ese ícono o usar el menú contextual, podrás restaurar la ventana o cerrar la aplicación. 12. Actualizar la Aplicación • Desde “Menú > Buscar actualizaciones”, la app revisa el repositorio de GitHub para ver si hay una versión más reciente. • Si la encuentra, te mostrará un aviso para **descargar** e **instalar**. Tras la descarga, se extraerán los archivos y se creará un script automático (BAT) para copiar la actualización y reiniciar el programa. • Al finalizar la instalación, la app se cerrará y se volverá a ejecutar con la nueva versión. 13. Cerrar la Aplicación • Al cerrar la ventana principal, si se está grabando, se te preguntará si deseas detener la grabación antes de salir. • Si la aplicación está convirtiendo el archivo (p.ej., a MP3), esperará a que la conversión termine. • Luego se cerrará por completo. Si minimizaste a la bandeja, primero tendrás que restaurar la ventana o cerrarla desde el menú contextual de la bandeja. 14. Consejos Finales • Ajusta los volúmenes de micrófono y sistema en la app para equilibrar las fuentes de audio. • Si notas que el audio está muy inclinado a un canal (izquierdo o derecho), marca la opción **Mono** o “Mezcla monoaural” (en algunos textos), para centrar el sonido. • Utiliza la **Prueba de Audio** para verificar que todo se escucha correctamente antes de hacer una grabación importante. • No olvides revisar las **Opciones** y **Menú** para personalizar tus hotkeys, idioma, carpeta de grabaciones y otras configuraciones. ¡Disfruta grabando con WASAPIRecording! Si encuentras útil esta aplicación, recuerda que puedes apoyarla haciendo clic en “Menú > invítame a un café si te gusta mi trabajo”.
de: 1. was ist WASAPIRecording? WASAPIRecording ist eine Windows-Anwendung, mit der Sie Ihr Mikrofon-Audio und Ihr System-Audio (Musik, Videoanrufe usw.) gleichzeitig aufnehmen können. Sie können beides in einer Datei kombinieren oder getrennt speichern (eine für das Mikrofon und eine für das Systemaudio). Zusätzlich zu den grundlegenden Aufnahmefunktionen enthält WASAPIRecording: - Ein automatisches Update-System, das auf neue Versionen auf GitHub prüft. - Ein Modul, um die Sprache der Benutzeroberfläche schnell zu ändern und die Anwendung bei Bedarf neu zu starten. - Konfigurationsoptionen zum Anpassen von Hotkeys und zum Minimieren des Fensters in den Systemtray. 2. Anforderungen - Windows 10 oder höher (mit WASAPI). - Berechtigungen zum Ausführen der Anwendung (Administrator ist nicht immer erforderlich, aber hilfreich bei eingeschränkten Berechtigungen). 3. Starten Sie die Anwendung - Führen Sie die Datei oder die Verknüpfung mit dem Namen "WASAPIRecording" aus. - Es öffnet sich das Hauptfenster mit Steuerelementen für Mikrofon, System, Audioformate, Aufnahmeoptionen, Hotkeys und andere Einstellungen. 4. Geräte und Parameter konfigurieren - Mikrofon**: Wählen Sie das Mikrofon aus, das Sie verwenden möchten. - System (Loopback)**: Wählen Sie das Gerät auf Ihrem PC aus, das alles aufnimmt, was auf dem System erklingt. - Geräte aktualisieren**: Wenn Sie ein neues Gerät angeschlossen haben und es nicht in der Liste erscheint, klicken Sie zum Aktualisieren darauf. - Qualität (Hz)**: Abtastfrequenz (22050, 44100 oder 48000). Je höher der Wert, desto höher die Qualität und die Dateigröße. - Ausgabeformat**: WAV, MP3, FLAC, OGG oder AIFF. - Bitrate MP3**: Erscheint nur, wenn Sie MP3 wählen; stellt die Kompressionsqualität ein. - Aufnahmemodus (Mono oder Stereo)**: Legt fest, wie die Kanäle gespeichert werden (2 Kanäle in Stereo oder beide Kanäle zentriert bei Mono). - Puffer (Frames)**: Größe des Audioblocks, der in jedem Aufnahmezyklus verarbeitet wird. - Separate Dateien speichern**: Wenn diese Option aktiviert ist, speichert die App zusätzlich zur "kombinierten" Datei zwei weitere Dateien (eine nur mit dem Mikrofon und eine mit dem System). 5. Lautstärke anpassen - Mikrofonlautstärke**: Verwenden Sie den Schieberegler, um die Mikrofonverstärkung zu erhöhen/verringern. - Systemlautstärke**: Stellen Sie die Verstärkung der PC-Töne ein, die Sie aufnehmen möchten. 6. Aufnahme starten und stoppen - Drücken Sie **Aufnahme starten** (oder standardmäßig den globalen Hotkey "Strg + Umschalt + F1"). Im Status wird "Aufnahme..." angezeigt. - Um **die Aufnahme zu stoppen**, klicken Sie auf **Aufnahme stoppen** (oder verwenden Sie "Strg + Umschalt + F2"). - Wenn Sie MP3, FLAC, OGG oder AIFF gewählt haben, konvertiert die App die endgültige Datei nach der Aufnahme und zeigt einen "Bitte warten..."-Dialog an, bis sie fertig ist. - Wenn die Konvertierung abgeschlossen ist, wird eine Aufforderung mit dem Pfad zu den erzeugten Dateien angezeigt. Wenn Sie die Option "Aufnahmeordner bei Fertigstellung öffnen" aktiviert haben (oder im Pop-up-Fenster mit "Ja" geantwortet haben), wird der Ordner, der die Dateien enthält, direkt geöffnet. 7. Wo die Aufnahmen gespeichert werden - Standardmäßig im Ordner "Aufnahmen" innerhalb des Anwendungsverzeichnisses. - Sie können den Aufnahmeordner unter "Menü > Optionen > Allgemein > Aufnahmeordner" ändern. - Um den Ordner aus der Anwendung heraus zu öffnen, klicken Sie auf "Menü > Aufzeichnungen öffnen". 8. Optionen und Menü Im Hauptfenster sehen Sie eine **Menü**-Schaltfläche, die Zugang zu folgenden Optionen bietet: - **Über...**: Zeigt die aktuelle Version von WASAPIRecording und den Namen des Erstellers an. - Aufnahmen öffnen**: Öffnet den Ordner, in dem die aufgenommenen Dateien gespeichert sind. - Sprache**: Ermöglicht es Ihnen, die Sprache der Benutzeroberfläche zu ändern (es, en, it, fr, etc.). Die Änderung wird nach dem Neustart der App übernommen. - Nach Updates suchen**: Prüft, ob es eine neue Version der App auf GitHub gibt. Wenn dies der Fall ist, können Sie die neue Version herunterladen und installieren und dann die App neu starten, um sie zu aktualisieren, ohne Ihre Einstellungen zu verlieren. - **Lade mich zum Kaffee ein, wenn dir meine Arbeit gefällt**: Leitet dich zu einer Spendenseite (z. B. PayPal) weiter. Außerdem finden Sie im **Menü** Folgendes: - **Optionen**: - **Allgemein**: Enthält das Kontrollkästchen "In die Taskleiste minimieren" und die Möglichkeit, den Aufnahmeordner zu ändern. - **Tastatur**: Hier können Sie die globalen Tastenkombinationen zum Starten, Stoppen, Anhalten und Abbrechen der Aufnahme anpassen. Hier wird auch angezeigt, wenn ein Tastaturkürzel "Nicht zugewiesen" ist oder ein Konflikt mit einer anderen Aktion besteht. 9. Audio-Test - Die Schaltfläche **Audiotest** öffnet ein spezielles Dialogfeld, in dem Sie einige Sekunden eines Audiobeispiels aufnehmen und sofort wiedergeben können. - Dieser Dialog erscheint immer im Vordergrund und **kann** nicht mit "X" oder Alt+F4 geschlossen werden; nur mit der Schaltfläche "Schließen". - Starten Sie zunächst die Testaufnahme mit der Schaltfläche "Stop" (mit der Sie die Kurzaufnahme beenden). - Dann wird dieselbe Taste zu "Play", um die Aufnahme anzuhören. - Wenn Sie "Getrennte Dateien speichern" angekreuzt haben, können Sie wählen, ob nur das Mikrofon, nur das System oder beides abgespielt werden soll. - Wenn Sie den Dialog schließen, werden die temporären Dateien gelöscht - ideal, um zu prüfen, ob alles gut klingt, bevor Sie eine endgültige Aufnahme machen. 10. Tastaturkürzel **Globale Tastenkombinationen** (Standard, anpassbar unter "Optionen > Tastatur"): - Aufnahme starten: **Strg + Umschalttaste + F1** - Aufnahme stoppen: **Strg + Umschalt + F2** Aufnahme anhalten/fortsetzen: *Strg + Umschalt + F2 - Aufnahme anhalten/fortsetzen: **Strg + Umschalt + F3** Pause/Fortsetzen der Aufnahme: *Strg + Umschalt + F3 - Aufnahme abbrechen: **Strg + Umschalttaste + F4** Aufnahme abbrechen: *Strg + Umschalttaste + F4 **Shortcuts innerhalb der Benutzeroberfläche** (mit der Alt-Taste, kann je nach Sprache variieren): - Mikrofon: **Alt + O** *System (Loopback) - System (Rückkopplung): **Alt + S** - Geräte aktualisieren: **Alt + R** - Qualität (Hz): **Alt + C** Ausgabeformat: **Alt + F** - Ausgabeformat: **Alt + F** Ausgabeformat: **Alt + F** - MP3-Bitrate (kbps): **Alt + B** - Mikrofon-Modus: **Alt + O** Systemmodus (Loopback) - Systemmodus (Rückkopplung): **Alt + S** Systemmodus (Rückkopplung): *Alt + S** - Puffergröße (Frames): **Alt + T** - Separate Dateien speichern: *alt + Y** Separate Dateien speichern: *Alt + Y** - Mikrofon-Lautstärke: **Alt + V** - System-Lautstärke: **Alt + V** Systemlautstärke: *Alt + V** - Aufnahme starten: **Alt + I** - Aufnahme stoppen: **Alt + D** Aufnahme beenden: *Alt + D** - Audio-Test: **Alt + P** - Menü: **Alt + M** - Schließen (in einigen Dialogen): **Alt + C** in einigen Sprachen können je nach Übersetzung andere Tasten verwendet werden. 11. In Ablage minimieren - Wenn Sie unter "Menü > Optionen > Allgemein" die Option "In die Taskleiste minimieren" aktivieren, wird die Anwendung durch Drücken der Schaltfläche "Minimieren" (obere rechte Ecke des Fensters) aus der Taskleiste ausgeblendet und ein Symbol in der Taskleiste (neben der Uhr) angezeigt. - Durch einen Doppelklick auf dieses Symbol oder über das Kontextmenü können Sie das Fenster wiederherstellen oder die Anwendung schließen. 12. Aktualisieren der Anwendung - Über "Menü > Nach Updates suchen" prüft die Anwendung das GitHub-Repository auf eine neuere Version. - Wenn sie gefunden wird, wird eine Aufforderung zum **Download** und zur **Installation** angezeigt. Nach dem Herunterladen werden die Dateien extrahiert und ein automatisches Skript (BAT) wird erstellt, um das Update zu kopieren und das Programm neu zu starten. - Am Ende der Installation wird die Anwendung geschlossen und mit der neuen Version erneut gestartet. 13. Schließen Sie die Anwendung - Beim Schließen des Hauptfensters werden Sie bei laufender Aufzeichnung gefragt, ob Sie die Aufzeichnung beenden möchten, bevor Sie die Anwendung beenden. - Wenn die Anwendung die Datei gerade konvertiert (z. B. in MP3), wartet sie, bis die Konvertierung abgeschlossen ist. - Danach wird sie vollständig geschlossen. Wenn Sie die Anwendung in die Taskleiste minimiert haben, müssen Sie das Fenster erst wiederherstellen oder über das Kontextmenü der Taskleiste schließen. 14. Letzte Tipps - Passen Sie die Mikrofon- und Systemlautstärke in der App an, um die Audioquellen auszugleichen. - Wenn Sie feststellen, dass der Ton stark auf einen Kanal (links oder rechts) verzerrt ist, aktivieren Sie die Option **Mono** oder "Mono Mix" (in einigen Texten), um den Ton zu zentrieren. - Verwenden Sie den **Audiotest**, um zu überprüfen, ob alles richtig klingt, bevor Sie eine wichtige Aufnahme machen. - Vergessen Sie nicht, die Optionen **Optionen** und **Menü** zu überprüfen, um Ihre Hotkeys, Sprache, Aufnahmeordner und andere Einstellungen anzupassen. viel Spaß beim Aufnehmen mit WASAPIRecording! Wenn Sie diese Anwendung nützlich finden, denken Sie daran, dass Sie sie unterstützen können, indem Sie auf "Menü > Laden Sie mich auf einen Kaffee ein, wenn Ihnen meine Arbeit gefällt" klicken.
fr: 1. qu'est-ce que l'enregistrement WASAPIR ? WASAPIRecording est une application Windows qui vous permet d'enregistrer simultanément l'audio de votre microphone et l'audio du système (musique, appels vidéo, etc.). Vous pouvez combiner les deux dans un seul fichier ou les enregistrer séparément (un pour le microphone et un pour l'audio du système). En plus des fonctions d'enregistrement de base, WASAPIRecording comprend : - Un système de mise à jour automatique qui vérifie la présence de nouvelles versions sur GitHub. - Un module permettant de changer rapidement la langue de l'interface et de redémarrer l'application si nécessaire. - Des options de configuration pour personnaliser les raccourcis clavier et minimiser la fenêtre dans la barre des tâches. 2. Exigences - Windows 10 ou supérieur (avec WASAPI). - Permissions d'exécuter l'application (administrateur n'est pas toujours nécessaire, mais aide dans les cas de permissions restreintes). 3. Démarrer l'application - Exécutez le fichier ou le raccourci appelé "WASAPIRecording". - La fenêtre principale s'ouvre avec des commandes pour le microphone, le système, les formats audio, les options d'enregistrement, les touches de raccourci et d'autres paramètres. 4. Configuration des appareils et des paramètres - Microphone** : sélectionnez le microphone que vous souhaitez utiliser. - Système (loopback)** : sélectionnez le dispositif sur votre PC qui capture tout ce qui est entendu sur le système. - Actualiser les périphériques** : si vous avez connecté un nouveau périphérique et qu'il n'apparaît pas dans la liste, cliquez pour l'actualiser. - Qualité (Hz)** : Fréquence d'échantillonnage (22050, 44100 ou 48000). Plus la valeur est élevée, plus la qualité et la taille du fichier sont importantes. - Format de sortie** : WAV, MP3, FLAC, OGG ou AIFF. - Bitrate MP3** : Apparaît uniquement si vous choisissez MP3 ; règle la qualité de la compression. - Mode d'enregistrement (mono ou stéréo)** : définit la manière dont les canaux seront stockés (2 canaux en stéréo ou les deux canaux centrés en mono). - Buffer (frames)** : Taille du bloc audio traité à chaque cycle d'enregistrement. - Enregistrer des fichiers séparés** : si cette option est cochée, en plus du fichier "combiné", l'application enregistrera deux autres fichiers (un avec le microphone uniquement et un avec le système). 5. Ajuster les volumes - Volume du microphone** : Utilisez le curseur pour augmenter/diminuer le gain du microphone. - Volume du système** : Réglez le gain des sons de l'ordinateur que vous souhaitez enregistrer. 6. Démarrer et arrêter l'enregistrement - Appuyez sur **Démarrer l'enregistrement** (ou sur la touche de raccourci globale "Ctrl + Shift + F1" par défaut). L'état affichera "Enregistrement...". - Pour **arrêter**, cliquez sur **Arrêter l'enregistrement** (ou utilisez "Ctrl + Shift + F2"). - Si vous avez choisi MP3, FLAC, OGG ou AIFF, l'application convertira le fichier final après l'enregistrement, en affichant une boîte de dialogue "Veuillez patienter..." jusqu'à ce que l'opération soit terminée. - Une fois l'opération terminée, une invite indiquant le chemin d'accès aux fichiers générés s'affiche. Si vous avez activé l'option "Open recordings folder on completion" (ou répondu "Yes" dans la fenêtre pop-up), le dossier contenant les fichiers sera ouvert directement. 7. Où sont sauvegardés les enregistrements - Par défaut, dans le dossier "recording" à l'intérieur du répertoire de l'application. - Vous pouvez modifier le dossier d'enregistrement dans "Menu > Options > Général > Dossier d'enregistrement". - Pour ouvrir le dossier à partir de l'application, cliquez sur "Menu > Ouvrir les enregistrements". 8. Options et menu Dans la fenêtre principale, vous verrez un bouton **Menu** qui donne accès à : - **A propos de...** : Affiche la version actuelle de WASAPIRecording et le nom du créateur. - Ouvrir les enregistrements** : Ouvre le dossier où sont stockés les fichiers enregistrés. - Langue** : Permet de changer la langue de l'interface (es, en, it, fr, etc.). Le changement est appliqué après le redémarrage de l'application. - Vérifier les mises à jour** : Vérifie s'il existe une nouvelle version de l'application sur GitHub. Si c'est le cas, vous pouvez télécharger et installer la nouvelle version, puis redémarrer l'application pour la mettre à jour sans perdre vos paramètres. - **invitez-moi à prendre un café si vous aimez mon travail** : vous redirige vers une page de don (par exemple, PayPal). Dans le **Menu**, vous trouverez également : - **Options** : - **Général** : comprend la case à cocher "Minimiser dans la barre des tâches" et la possibilité de changer le dossier des enregistrements. - **Clavier** : vous permet de personnaliser les raccourcis globaux pour démarrer, arrêter, mettre en pause et annuler l'enregistrement. Il est également indiqué ici si un raccourci est "non attribué" ou s'il y a un conflit avec une autre action. 9. Test audio - Le bouton **Test audio** ouvre une boîte de dialogue spéciale permettant d'enregistrer un échantillon audio de quelques secondes et de le lire immédiatement. - Cette boîte de dialogue apparaît toujours au premier plan et ne peut pas être fermée avec "X" ou Alt+F4 ; seulement avec le bouton "Fermer". - Commencez par lancer l'enregistrement test à l'aide du bouton "Stop" (qui est utilisé pour terminer l'enregistrement court). - Ensuite, le même bouton devient "Play", pour écouter l'enregistrement. - Si vous avez coché "Enregistrer des fichiers séparés", vous pouvez choisir de n'écouter que le microphone, que le système ou les deux. - Lorsque vous fermez la boîte de dialogue, les fichiers temporaires sont supprimés, ce qui est idéal pour vérifier que tout sonne bien avant de procéder à l'enregistrement final. 10. Raccourcis clavier **Raccourcis globaux** (par défaut, personnalisables dans "Options > Clavier") : - Démarrer l'enregistrement : **Ctrl + Shift + F1** - Arrêter l'enregistrement : **Ctrl + Shift + F2** Pause/reprise de l'enregistrement : *Ctrl + Shift + F2 - Pause/reprise de l'enregistrement : **Ctrl + Shift + F3** Pause/reprise de l'enregistrement : *Ctrl + Shift + F3 - Annuler l'enregistrement : **Ctrl + Shift + F4** Annuler l'enregistrement : *Ctrl + Shift + F4 **Raccourcis dans l'interface** (avec la touche Alt, peut varier selon la langue) : - Microphone : **Alt + O** *Système (bouclage) - Système (bouclage) : **Alt + S** - Rafraîchir les périphériques : **Alt + R** - Qualité (Hz) : **Alt + C** Format de sortie : **Alt + F** - Format de sortie : **Alt + F** Format de sortie : **Alt + F** - Débit binaire MP3 (kbps) : **Alt + B** - Mode microphone : **Alt + O** Mode système (bouclage) - Mode système (bouclage) : **Alt + S** Mode système (bouclage) : *Alt + S** - Taille de la mémoire tampon (trames) : **Alt + T** - Sauvegarder des fichiers séparés : *alt + Y** Enregistrer des fichiers séparés : *Alt + Y** - Volume du microphone : **Alt + V** - Volume du système : **Alt + V** Volume du système : *Alt + V** - Démarrer l'enregistrement : **Alt + I** - Arrêter l'enregistrement : **Alt + D** Arrêter l'enregistrement : *Alt + D** - Test audio : **Alt + P** - Menu : **Alt + M** - Fermer (dans certains dialogues) : **Alt + C** dans certaines langues peuvent varier ou d'autres touches peuvent être utilisées en fonction de la traduction. 11. Minimiser dans le bac - Si vous activez l'option "Minimiser dans la barre des tâches" dans "Menu > Options > Général", le fait d'appuyer sur le bouton "Minimiser" (dans le coin supérieur droit de la fenêtre) masquera l'application de la barre des tâches et une icône apparaîtra dans la barre d'état système (près de l'horloge). - En double-cliquant sur cette icône ou en utilisant le menu contextuel, vous pouvez restaurer la fenêtre ou fermer l'application. 12. Mise à jour de l'application - À partir de "Menu > Vérifier les mises à jour", l'application vérifie la présence d'une version plus récente dans le dépôt GitHub. - Si elle est trouvée, elle vous invitera à **télécharger** et **installer**. Après le téléchargement, les fichiers seront extraits et un script automatique (BAT) sera créé pour copier la mise à jour et redémarrer le programme. - À la fin de l'installation, l'application se fermera et s'exécutera à nouveau avec la nouvelle version. 13. Fermer l'application - Lors de la fermeture de la fenêtre principale, si l'enregistrement est en cours, il vous sera demandé si vous souhaitez arrêter l'enregistrement avant de quitter l'application. - Si l'application est en train de convertir le fichier (par exemple en MP3), elle attendra que la conversion soit terminée. - Elle se ferme ensuite complètement. Si vous avez minimisé la fenêtre dans la barre des tâches, vous devrez d'abord la restaurer ou la fermer à partir du menu contextuel de la barre des tâches. 14. Derniers conseils - Réglez les volumes du microphone et du système dans l'application pour équilibrer les sources audio. - Si vous remarquez que l'audio est fortement orienté vers un canal (gauche ou droit), cochez l'option **Mono** ou "Mono Mix" (dans certains textes), pour centrer le son. - Utilisez le **Test audio** pour vérifier que tout sonne correctement avant d'effectuer un enregistrement important. - N'oubliez pas de consulter les **Options** et **Menu** pour personnaliser vos touches de raccourci, la langue, le dossier d'enregistrement et d'autres paramètres. profitez de l'enregistrement avec WASAPIRecording ! Si vous trouvez cette application utile, n'oubliez pas que vous pouvez la soutenir en cliquant sur "Menu > invitez-moi à prendre un café si vous aimez mon travail".
it: 1. Che cos'è WASAPIRecording? WASAPIRecording è un'applicazione Windows che consente di registrare contemporaneamente l'audio del microfono e l'audio del sistema (musica, videochiamate, ecc.). È possibile combinare entrambi in un unico file o salvarli separatamente (uno per il microfono e uno per l'audio di sistema). Oltre alle funzioni di registrazione di base, WASAPIRecording include: - Un sistema di aggiornamento automatico che controlla le nuove versioni su GitHub. - Un modulo per cambiare rapidamente la lingua dell'interfaccia e riavviare l'applicazione, se necessario. - Opzioni di configurazione per personalizzare i tasti di scelta rapida e minimizzare la finestra nel System Tray. 2. Requisiti - Windows 10 o superiore (con WASAPI). - Autorizzazioni per l'esecuzione dell'applicazione (l'amministratore non è sempre necessario, ma è utile in caso di autorizzazioni limitate). 3. Avviare l'applicazione - Eseguire il file o il collegamento chiamato "WASAPIRecording". - Si aprirà la finestra principale con i controlli per microfono, sistema, formati audio, opzioni di registrazione, tasti di scelta rapida e altre impostazioni. 4. Configurazione di dispositivi e parametri - Microfono**: selezionare il microfono che si desidera utilizzare. - Sistema (loopback)**: selezionare il dispositivo del PC che cattura tutti i suoni del sistema. - Aggiorna dispositivi**: se è stato collegato un nuovo dispositivo e questo non compare nell'elenco, fare clic per aggiornarlo. - Qualità (Hz)**: frequenza di campionamento (22050, 44100 o 48000). Più alto è il valore, maggiore è la qualità e la dimensione del file. - Formato di uscita**: WAV, MP3, FLAC, OGG o AIFF. - Bitrate MP3**: appare solo se si sceglie MP3; regola la qualità della compressione. - Modalità di registrazione (Mono o Stereo)**: definisce la modalità di registrazione dei canali (2 canali in stereo o entrambi i canali centrati se mono). - Buffer (frames)**: dimensione del blocco audio che viene elaborato in ogni ciclo di registrazione. - Salva file separatamente**: se selezionata, oltre al file "combinato", l'applicazione salverà altri due file (uno solo per il microfono e uno per il sistema). 5. Regola i volumi - Volume del microfono**: utilizzare il cursore per aumentare/diminuire il guadagno del microfono. - Volume di sistema**: regolare il guadagno dei suoni del PC che si desidera registrare. 6. Avvio e interruzione della registrazione - Premere **Avvia registrazione** (o il tasto di scelta rapida globale "Ctrl + Maiusc + F1" per impostazione predefinita). Lo stato mostrerà "Registrazione...". - Per **arrestare**, fare clic su **Arresta registrazione** (o usare "Ctrl + Maiusc + F2"). - Se si è scelto MP3, FLAC, OGG o AIFF, l'applicazione convertirà il file finale dopo la registrazione, visualizzando una finestra di dialogo "Attendere prego..." fino al termine. - Al termine, verrà visualizzato un messaggio con il percorso dei file generati. Se si è attivata l'opzione "Apri cartella registrazioni al termine" (o si è risposto "Sì" nella finestra a comparsa), la cartella contenente i file verrà aperta direttamente. 7. Dove vengono salvate le registrazioni - Per impostazione predefinita, nella cartella "recording" all'interno della cartella dell'applicazione. - È possibile modificare la cartella di registrazione in "Menu > Opzioni > Generali > Cartella di registrazione". - Per aprire la cartella dall'applicazione, fare clic su "Menu > Apri registrazioni". 8. Opzioni e menu Nella finestra principale è presente un pulsante **Menu** che consente di accedere a: - **Informazioni su...**: visualizza la versione attuale di WASAPIRecording e il nome del creatore. - Apri registrazioni**: apre la cartella in cui sono memorizzati i file registrati. - Lingua**: consente di cambiare la lingua dell'interfaccia (es, en, it, fr, ecc.). La modifica viene applicata dopo il riavvio dell'applicazione. - Verifica aggiornamenti**: controlla se esiste una nuova versione dell'applicazione su GitHub. In caso affermativo, è possibile scaricare e installare la nuova versione, quindi riavviare l'app per aggiornare senza perdere le impostazioni. - **invitami al caffè se ti piace il mio lavoro**: ti reindirizza a una pagina di donazione (ad esempio, PayPal). Inoltre, all'interno del **Menu**, troverete: - **Opzioni**: - **Generali**: include la casella di controllo "Riduci a icona nel System Tray" e la possibilità di cambiare la cartella delle registrazioni. - **Tastiera**: consente di personalizzare le scorciatoie globali per avviare, fermare, mettere in pausa e annullare la registrazione. Viene anche mostrato se una scorciatoia è "Non assegnata" o se c'è un conflitto con un'altra azione. 9. Test audio - Il pulsante **Test Audio** apre una finestra di dialogo speciale per registrare alcuni secondi di audio campione e riprodurlo immediatamente. - Questa finestra di dialogo appare sempre in primo piano e non può essere chiusa con "X" o Alt+F4, ma solo con il pulsante "Chiudi". - Per prima cosa, si avvia la registrazione di prova. Con il pulsante "Arresta" (che viene utilizzato per terminare la breve registrazione). - Poi, lo stesso pulsante diventa "Riprodurre", per ascoltare la registrazione. - Se è stata selezionata l'opzione "Salva file separatamente", è possibile scegliere di riprodurre solo il microfono, solo il sistema o entrambi. - Quando si chiude la finestra di dialogo, i file temporanei vengono cancellati, il che è perfetto per verificare che tutto suoni bene prima di effettuare la registrazione finale. 10. Scorciatoie da tastiera **Scorciatoie globali** (predefinite, personalizzabili in "Opzioni > Tastiera"): - Avvia registrazione: **Ctrl + Shift + F1** - Arresta registrazione: **Ctrl + Shift + F2** Mettere in pausa/Riprendere la registrazione: *Ctrl + Shift + F2 - Pausa/Ripresa della registrazione: **Ctrl + Shift + F3** Mettere in pausa/Riprendere la registrazione: *Ctrl + Shift + F3 - Annullamento della registrazione: **Ctrl + Shift + F4** Annullamento della registrazione: *Ctrl + Shift + F4 **Scorciatoie all'interno dell'interfaccia** (con il tasto Alt, può variare a seconda della lingua): - Microfono: **Alt + O** *Sistema (loopback) - Sistema (loopback): **Alt + S** - Aggiorna dispositivi: **Alt + R** - Qualità (Hz): **Alt + Q** Formato di uscita: **Alt + F** - Formato di uscita: **Alt + F** Formato di uscita: **Alt + F** - Bitrate MP3 (kbps): **Alt + B** - Modalità microfono: **Alt + O** Modalità di sistema (loopback) - Modalità sistema (loopback): **Alt + S** Modalità di sistema (loopback): *Alt + S** - Dimensione del buffer (fotogrammi): **Alt + T** - Salva file separati: *alt + Y** Salvare file separati: *Alt + Y** - Volume del microfono: **Alt + V** - Volume del sistema: **Alt + V** Volume del sistema: *Alt + V** - Avvia la registrazione: **Alt + I** - Interrompi registrazione: **Alt + D** Interrompi registrazione: *Alt + D** - Test audio: **Alt + P** - Menu: **Alt + M** - Chiudi (in alcuni dialoghi): **Alt + C** in alcune lingue può variare o possono essere utilizzati altri tasti a seconda della traduzione. 11. Riduci a icona nel System Tray - Se si attiva l'opzione "Riduci a icona nel System Tray" in "Menu > Opzioni > Generali", premendo il pulsante di riduzione a icona (nell'angolo in alto a destra della finestra) l'applicazione viene nascosta dalla barra delle applicazioni e viene visualizzata un'icona nel System Tray (vicino all'orologio). - Facendo doppio clic su tale icona o utilizzando il menu contestuale, è possibile ripristinare la finestra o chiudere l'applicazione. 12. Aggiornare l'applicazione - Da "Menu > Controlla aggiornamenti", l'applicazione controlla il repository GitHub per verificare la presenza di una versione più recente. - Se viene trovata, viene visualizzato un prompt per **scaricare** e **installare**. Dopo il download, i file verranno estratti e verrà creato uno script automatico (BAT) per copiare l'aggiornamento e riavviare il programma. - Al termine dell'installazione, l'applicazione si chiuderà e verrà eseguita nuovamente con la nuova versione. 13. Chiudere l'applicazione - Quando si chiude la finestra principale, se la registrazione è in corso, viene chiesto se si desidera interrompere la registrazione prima di uscire. - Se l'applicazione sta convertendo il file (ad esempio in MP3), attenderà il termine della conversione. - A questo punto si chiude completamente. Se la finestra è stata ridotta a icona, è necessario ripristinarla o chiuderla dal menu contestuale della barra. 14. Suggerimenti finali - Regolate il volume del microfono e del sistema nell'applicazione per bilanciare le fonti audio. - Se si nota che l'audio è fortemente sbilanciato verso un canale (destro o sinistro), selezionare l'opzione **Mono** o "Mono Mix" (in alcuni contesti), per centrare il suono. - Utilizzare il **Test audio** per verificare che tutto suoni correttamente prima di effettuare una registrazione importante. - Non dimenticate di controllare le **Opzioni** e il **Menu** per personalizzare i tasti di scelta rapida, la lingua, la cartella di registrazione e altre impostazioni. divertitevi a registrare con WASAPIRecording! Se trovate utile questa applicazione, ricordate che potete sostenerla facendo clic su "Menu > invitami a bere un caffè se ti piace il mio lavoro".
pt: 1. o que é WASAPIRecording? O WASAPIRecording é um aplicativo do Windows que permite gravar o áudio do microfone e o áudio do sistema (música, chamadas de vídeo etc.) simultaneamente. É possível combinar ambos em um único arquivo ou salvá-los separadamente (um para o microfone e outro para o áudio do sistema). Além das funções básicas de gravação, o WASAPIRecording inclui: - Um sistema de atualização automática que verifica se há novas versões no GitHub. - Um módulo para alterar rapidamente o idioma da interface e reiniciar o aplicativo, se necessário. - Opções de configuração para personalizar as teclas de atalho e minimizar a janela na bandeja do sistema. 2. Requisitos - Windows 10 ou superior (com WASAPI). - Permissões para executar o aplicativo (administrador nem sempre é necessário, mas ajuda em casos de permissões restritas). 3. Iniciar o aplicativo - Execute o arquivo ou atalho chamado "WASAPIRecording". - A janela principal será aberta com controles para microfone, sistema, formatos de áudio, opções de gravação, teclas de atalho e outras configurações. 4. Configurar dispositivos e parâmetros - Microfone**: Selecione o microfone que deseja usar. - Sistema (loopback)**: Selecione o dispositivo em seu PC que captura tudo o que soa no sistema. - Refresh Devices**: Se você conectou um novo dispositivo e ele não aparece na lista, clique para atualizar. - Quality (Hz)**: Frequência de amostragem (22050, 44100 ou 48000). Quanto maior o valor, maior a qualidade e o tamanho do arquivo. - Formato de saída**: WAV, MP3, FLAC, OGG ou AIFF. - Bitrate MP3**: Aparece somente se você escolher MP3; ajusta a qualidade da compactação. - Modo de gravação (mono ou estéreo)**: Define como os canais serão armazenados (2 canais em estéreo ou ambos os canais centralizados se forem mono). - Buffer (frames)**: Tamanho do bloco de áudio que é processado em cada ciclo de gravação. - Save separate files**: Se marcada, além do arquivo "combinado", o aplicativo salvará dois outros arquivos (um somente com o microfone e outro com o sistema). 5. Ajustar volumes - Volume do microfone**: Use o controle deslizante para aumentar/diminuir o ganho do microfone. - Volume do sistema**: Ajuste o ganho dos sons do PC que você deseja gravar. 6. Iniciar e parar a gravação - Pressione **Start Recording** (ou a tecla de atalho global "Ctrl + Shift + F1" por padrão). O status mostrará "Recording..." (Gravando...). - Para **parar**, clique em **Stop Recording** (ou use "Ctrl + Shift + F2"). - Se você escolher MP3, FLAC, OGG ou AIFF, o aplicativo converterá o arquivo final após a gravação, exibindo uma caixa de diálogo "Please wait..." (Aguarde...) até que seja concluído. - Quando terminar, será exibido um prompt com o caminho para os arquivos gerados. Se você tiver ativado a opção "Open recordings folder on completion" (ou respondido "Yes" na janela pop-up), a pasta que contém os arquivos será aberta diretamente. 7. Onde as gravações são salvas - Por padrão, na pasta "recording" (gravação) dentro do diretório do aplicativo. - Você pode alterar a pasta de gravação em "Menu > Options > General > Recording folder" (Menu > Opções > Geral > Pasta de gravação). - Para abrir a pasta no aplicativo, clique em "Menu > Open Recordings" (Menu > Abrir gravações). 8. Opções e menu Na janela principal, você verá um botão **Menu** que dá acesso a: - **About...**: Exibe a versão atual do WASAPIRecording e o nome do criador. - Open Recordings**: Abre a pasta onde os arquivos gravados estão armazenados. - Language**: Permite que você altere o idioma da interface (es, en, it, fr, etc.). A alteração é aplicada após a reinicialização do aplicativo. - Check for updates**: Verifica se há uma nova versão do aplicativo no GitHub. Se houver, você poderá fazer download e instalar a nova versão e, em seguida, reiniciar o aplicativo para atualizar sem perder suas configurações. - **invite-me para um café se você gostar do meu trabalho**: redireciona você para uma página de doação (por exemplo, PayPal). Além disso, no **Menu**, você encontrará: - **Opções**: - **General**: Inclui a caixa de seleção "Minimizar para a bandeja do sistema" e a possibilidade de alterar a pasta de gravações. - **Keyboard**: Permite personalizar os atalhos globais para iniciar, parar, pausar e cancelar a gravação. Também é mostrado aqui se um atalho está "Não atribuído" ou se há um conflito com outra ação. 9. Teste de áudio - O botão **Audio Test** abre uma caixa de diálogo especial para gravar alguns segundos de amostra de áudio e reproduzi-lo imediatamente. - Essa caixa de diálogo é sempre exibida em primeiro plano e não pode ser fechada com "X" ou Alt+F4; somente com o botão "Fechar". - Primeiro, inicie a gravação de teste com o botão "Stop" (que é usado para encerrar a gravação curta). - Em seguida, o mesmo botão se torna "Play", para ouvir a gravação. - Se tiver marcado "Save separate files" (Salvar arquivos separados), você poderá optar por reproduzir somente o microfone, somente o sistema ou ambos. - Quando você fecha a caixa de diálogo, os arquivos temporários são excluídos, o que é perfeito para verificar se tudo soa bem antes de fazer uma gravação final. 10. Atalhos de teclado **Atalhos globais** (padrão, personalizável em "Options > Keyboard"): - Iniciar gravação: **Ctrl + Shift + F1** - Parar gravação: **Ctrl + Shift + F2** Pausar/Retomar a gravação: *Ctrl + Shift + F2 - Pausar/Retomar a gravação: *pausar/retomar a gravação: *Ctrl + Shift + F3** Pausar/retomar a gravação: *Ctrl + Shift + F3 - Cancelar gravação: *cancelar gravação: *Ctrl + Shift + F4** Cancelar gravação: *Ctrl + Shift + F4 **Atalhos na interface** (com a tecla Alt, pode variar dependendo do idioma): - Microfone: **Alt + O** *Sistema (loopback) - Sistema (loopback): **Alt + S** - Atualizar dispositivos: **Alt + R** - Qualidade (Hz): **Alt + C** Formato de saída: **Alt + F** - Formato de saída: **Alt + F** Formato de saída: **Alt + F** - Taxa de bits de MP3 (kbps): **Alt + B** - Modo de microfone: **Alt + O** Modo do sistema (loopback) - Modo do sistema (loopback): **Alt + S** Modo do sistema (loopback): *Alt + S** - Tamanho do buffer (quadros): **Alt + T** - Salvar arquivos separados: *alt + Y** Salvar arquivos separados: *Alt + Y** - Volume do microfone: **Alt + V** - Volume do sistema: **Alt + V** - Iniciar gravação: **Alt + I** - Stop Recording (Parar gravação): **Alt + D** Parar gravação: *Alt + D** - Teste de áudio: **Alt + P** - Menu: **Alt + M** - Fechar (em alguns diálogos): **Alt + C** em alguns idiomas pode variar ou outras teclas podem ser usadas, dependendo da tradução. 11. Minimizar para a bandeja - Se você ativar "Minimizar na bandeja" em "Menu > Opções > Geral", pressionar o botão minimizar (canto superior direito da janela) ocultará o aplicativo da barra de tarefas e um ícone será exibido na bandeja do sistema (próximo ao relógio). - Ao clicar duas vezes nesse ícone ou usar o menu de contexto, você pode restaurar a janela ou fechar o aplicativo. 12. Atualizar o aplicativo - Em "Menu > Check for updates", o aplicativo verifica se há uma versão mais recente no repositório do GitHub. - Se for encontrada, ele mostrará um prompt para **download** e **instalação**. Após o download, os arquivos serão extraídos e um script automático (BAT) será criado para copiar a atualização e reiniciar o programa. - Ao final da instalação, o aplicativo será fechado e executado novamente com a nova versão. 13. Fechar o aplicativo - Ao fechar a janela principal, se a gravação estiver em andamento, você será perguntado se deseja interromper a gravação antes de sair. - Se o aplicativo estiver convertendo o arquivo (por exemplo, para MP3), ele aguardará a conclusão da conversão. - Em seguida, ele será fechado completamente. Se você tiver minimizado para a bandeja, primeiro terá que restaurar a janela ou fechá-la no menu de contexto da bandeja. 14. Dicas finais - Ajuste os volumes do microfone e do sistema no aplicativo para equilibrar as fontes de áudio. - Se você perceber que o áudio está muito inclinado para um canal (esquerdo ou direito), marque a opção **Mono** ou "Mono Mix" (em alguns textos) para centralizar o som. - Use o **Teste de áudio** para verificar se tudo soa corretamente antes de fazer uma gravação importante. - Não se esqueça de verificar as **Opções** e o **Menu** para personalizar as teclas de atalho, o idioma, a pasta de gravação e outras configurações. divirta-se gravando com o WASAPIRecording! Se você achar este aplicativo útil, lembre-se de que pode apoiá-lo clicando em "Menu > invite me for a coffee if you like my work" (Menu > convide-me para um café se gostar do meu trabalho).
tr: 1. WASAPIRecording nedir? WASAPIRecording, mikrofon sesinizi ve sistem sesini (müzik, görüntülü aramalar vb.) aynı anda kaydetmenizi sağlayan bir Windows uygulamasıdır. İkisini tek bir dosyada birleştirebilir veya ayrı ayrı kaydedebilirsiniz (biri mikrofon ve diğeri sistem sesi için). Temel kayıt işlevlerine ek olarak, WASAPIRecording şunları içerir: • GitHub'da yeni sürümleri kontrol eden bir otomatik güncelleme sistemi. • Arayüz dilini hızlı bir şekilde değiştirmek ve gerekirse uygulamayı yeniden başlatmak için bir modül. • Kısayol tuşlarını özelleştirmek ve pencereyi sistem tepsisine küçültmek için yapılandırma seçenekleri. 2. Gereksinimler: • Windows 10 veya sonrası (WASAPI ile). • Uygulamayı çalıştırma izinleri (yönetici her zaman gerekli değildir, ancak kısıtlı izinler durumunda yardımcı olur). 3. Uygulamayı Başlat: • "WASAPIRecording" adlı dosyayı veya kısayolu çalıştırın. • Mikrofon, sistem, ses biçimleri, kayıt seçenekleri, kısayol tuşları ve diğer ayarlar için kontrollerle ana pencere açılacaktır. 4. Cihazları ve Parametreleri Yapılandırma: • Mikrofon : Kullanmak istediğiniz mikrofonu seçin. • Sistem (geri döngü): PC'nizde, sistemde çalan her şeyi yakalayan cihazı seçin. • Cihazları Yenile : Yeni bir cihaz bağladıysanız ve cihaz listede görünmüyorsa, güncellemek için tıklayın. • Kalite (Hz) : Örnekleme hızı (22050, 44100 veya 48000). Değer ne kadar yüksek olursa, kalite ve dosya boyutu da o kadar yüksek olur. • Çıkış Biçimi : WAV, MP3, FLAC, OGG veya AIFF. • MP3 Bit Hızı : Yalnızca MP3'ü seçerseniz görünür; Sıkıştırma kalitesini ayarlayın. • Kayıt Modu (Mono veya Stereo): Kanalların nasıl kaydedileceğini tanımlar (stereo olarak 2 kanal veya mono ise her iki kanal ortalanmış). • Arabellek (çerçeveler): Her kayıt döngüsünde işlenen ses bloğunun boyutu. • Ayrı dosyaları kaydedin : İşaretlerseniz, "birleşik" dosyaya ek olarak, uygulama iki başka dosya daha kaydeder (biri yalnızca mikrofonla ve diğeri sistemle). 5. Ses Düzeylerini Ayarlayın: • Mikrofon Ses seviyesi : Mikrofon ses seviyesini yukarı/aşağı değiştirmek için kaydırıcıyı kullanın. • Sistem Ses Seviyesi : Kaydetmek istediğiniz PC seslerinin ses seviyesini ayarlayın. 6. Kaydı Başlat ve Durdur: • Kaydı Başlat'a (veya varsayılan "Ctrl + Shift + F1" genel kısayol tuşuna) basın. Durum "Kaydediliyor..." olarak gösterecektir. • Durdurmak için Kaydı Durdur'u tıklayın (veya "Ctrl + Shift + F2" tuşlarını kullanın). • MP3, FLAC, OGG veya AIFF'yi seçtiyseniz, uygulama kayıttan sonra son dosyayı dönüştürerek "Lütfen bekleyin..." bitene kadar. • Bittiğinde, oluşturulan dosyaların yolunu içeren bir bildirim görüntülenecektir. "Bittiğinde kayıt klasörünü aç" seçeneğini etkinleştirdiyseniz (veya açılır pencerede "Evet" yanıtını verdiyseniz), dosyaları içeren klasör doğrudan açılacaktır. 7. Kayıtların kaydedildiği yer: • Varsayılan olarak, uygulama dizini içindeki "kayıt" klasöründe. • Kayıtlar klasörünü "Menü > Seçenekler > Genel > Kayıtlar Klasörü" bölümünden değiştirebilirsiniz. • Klasörü uygulamadan açmak için "Menü > Kayıtları Aç"ı tıklayın. 8. Seçenekler ve Menü: Ana pencerede, aşağıdakilere erişim sağlayan bir Menü düğmesi göreceksiniz: • Hakkında... : WASAPIRecording'in mevcut sürümünü ve Geliştiricinin adını görüntüler. • Kayıtları Aç : Kaydedilen dosyaların saklandığı klasörü açar. • Dil : Arayüzün dilini değiştirmenizi sağlar (es, en, it, fr, vb.). Değişiklik, uygulamanızı yeniden başlattıktan sonra geçerli olur. • Güncellemeleri Denetle: GitHub'da uygulamanızın yeni bir sürümünü kontrol edin. Varsa, yeni sürümü indirip yükleyebilir ve ardından ayarlarınızı kaybetmeden güncellemek için uygulamayı yeniden başlatabilirsiniz. • Çalışmamı beğendiysen bana bir kahve ısmarla: Sizi bir bağış sayfasına yönlendirir (ör. PayPal). Ek olarak, Menü içinde şunları bulacaksınız: • Seçenekler : - Genel : "Sistem tepsisine küçült" onay kutusunu ve kayıt klasörünü değiştirme olanağını içerir. - Klavye : Kaydı başlatmak, durdurmak, duraklatmak ve iptal etmek için genel kısayolları özelleştirmenizi sağlar. Burada ayrıca bir kısayolun "Atanmamış" olup olmadığını veya başka bir eylemle çakışma olup olmadığını da gösterir. 9. Ses Testi • Ses Testi düğmesi, birkaç saniyelik örnek kaydetmek ve bunları hemen oynatmak için özel bir iletişim kutusu açar. • Bu iletişim kutusu her zaman ön planda görünür ve "X" veya Alt+F4 tuşlarıyla kapatılamaz; sadece "Kapat" düğmesiyle kapatılabilir. • İlk olarak, "Durdur" düğmesiyle (kısa kaydı sonlandırmaya yarar) test kaydını başlatın. • Daha sonra, kaydı dinlemek için aynı düğme "Oynat" olur. • "Ayrı dosyaları kaydet" seçeneğini işaretlediyseniz, yalnızca mikrofonu, yalnızca sistemi veya her ikisini birden oynatmayı seçebilirsiniz. • İletişim kutusunu kapattığınızda, geçici dosyalar silinir, son bir kayıt yapmadan önce her şeyin iyi ses çıkardığını doğrulamak için mükemmeldir. 10. Klavye Kısayolları: Genel Kısayollar (varsayılan olarak, "Klavye > Seçenekleri"nde özelleştirilebilir): • Kaydı Başlat: Ctrl + Shift + F1 • Kaydı Durdur: Ctrl + Shift + F2 • Kaydı Duraklat/Sürdür: Ctrl + Shift + F3 • Kaydı İptal Et: Ctrl + Shift + F4 Arayüz içindeki kısayollar (Alt tuşuyla, dile bağlı olarak değişebilir): • Mikrofon: Alt + O • Sistem (geri döngü): Alt + G • Aygıtları Yenile: Alt + R • Kalite (Hz): Alt + K • Çıkış Biçimi: Alt + Ç • MP3 bit hızı (kbps): Alt + B • Mikrofon modu: Alt + O • Sistem Modu (geri döngü): Alt + S • Arabellek Boyutu (çerçeveler): Alt + T • Mikrofon ve sistem dosyalarını ayrı ayrı kaydet Alt+y • Mikrofon Ses seviyesi: Alt + S • Sistem Ses Seviyesi: Alt + V • Kaydı Başlat: Alt + I • Kaydı Durdur: Alt + D • Ses Testi: Alt + T • Menü: Alt + M • Kapat (bazı iletişim kutularında): Alt + K Bazı dillerde, çeviriye bağlı olarak değişebilir veya başka tuşlar kullanılabilir. 11. Sistem Tepsisine Küçült: • "Menü > Seçenekler > Genel"de "Tepsiye Küçült" seçeneğini etkinleştirirseniz, simge durumuna küçült düğmesine (pencerenin sağ üst köşesi) basmak uygulamayı görev çubuğundan gizler ve sistem tepsisinde (saatin yanında) bir simge belirir. • Bu simgeye çift tıklayarak veya içerik menüsünü kullanarak pencereyi geri yükleyebilir veya uygulamayı kapatabilirsiniz. 12. Uygulamayı Güncelle: • "Menü > Güncellemeleri Denetle" bölümünden, uygulamanız GitHub deposunda daha yeni bir sürüm olup olmadığını kontrol eder. • bulursa, size indirmeniz ve yüklemeniz için bir istem gösterecektir. İndirdikten sonra dosyalar ayıklanır ve güncellemeyi kopyalamak ve programı yeniden başlatmak için otomatik bir komut dosyası (BAT) oluşturulur. • Kurulum tamamlandığında, uygulama kapanacak ve yeni sürümle tekrar çalışacaktır. 13. Uygulamayı kapatın: • Ana pencereyi kapattığınızda eğer kayıt yapıyorsa çıkmadan önce kaydı durdurmak isteyip istemediğiniz sorulacaktır. • Uygulama dosyayı dönüştürüyorsa (örneğin MP3'e), dönüştürmenin bitmesini bekleyecektir. • Daha sonra tamamen kapanacaktır. Tepsiye küçülttüyseniz, önce pencereyi geri yüklemeniz veya tepsi içerik menüsünden kapatmanız gerekir. 14. Son İpuçları: • Ses kaynaklarını dengelemek için uygulamada mikrofon ve sistem ses düzeylerini ayarlayın. • Sesin yoğun bir şekilde tek bir kanala (sola veya sağa) kaydığını fark ederseniz, sesi ortalamak için Mono veya "Mono Karışım" seçeneğini (bazı metinlerde) işaretleyin. • Önemli bir kayıt yapmadan önce her şeyin doğru şekilde duyulduğunu doğrulamak için Ses Testini kullanın. • Kısayol tuşlarınızı, dilinizi, kayıt klasörünüzü ve diğer ayarlarınızı özelleştirmek için Seçenekler ve Menüyü kontrol etmeyi unutmayın. WASAPIRecording ile kayıt yapmanın keyfini çıkarın! Bu uygulamayı faydalı bulduysanız “Menü > çalışmalarımı beğendiyseniz bana bir kahve ısmarla” seçeneğine tıklayarak destek olabileceğinizi unutmayın.
