Repository: hxebolax/WASAPIRecording
Catalog: src/locales/*/LC_MESSAGES/app.po
Languages: de, fr, it, pt, tr

source: No se encontró el archivo necesario para completar la operación.
de: Die Datei, die für die Ausführung des Vorgangs benötigt wird, wurde nicht gefunden.
fr: Le fichier nécessaire à la réalisation de l'opération n'a pas été trouvé.
it: Il file necessario per completare l'operazione non è stato trovato.
pt: O arquivo necessário para concluir a operação não foi encontrado.
tr: İşlemi tamamlamak için gerekli dosya bulunamadı.

source: Se esperaba un archivo, pero se encontró un directorio.
de: Es wurde eine Datei erwartet, aber es wurde ein Verzeichnis gefunden.
fr: Un fichier était attendu, mais un répertoire a été trouvé.
it: Era previsto un file, ma è stata trovata una directory.
pt: Um arquivo era esperado, mas um diretório foi encontrado.
tr: Bir dosya bekleniyordu, ancak bir dizin bulundu.

source: Permiso denegado. Ejecute la aplicación con los permisos adecuados.
de: Berechtigung verweigert. Führen Sie die Anwendung mit den entsprechenden Berechtigungen aus.
fr: Permission refusée. Exécutez l'application avec les autorisations appropriées.
it: Autorizzazione negata. Esegui l'applicazione con le autorizzazioni appropriate.
pt: Permissão negada. Execute o aplicativo com as permissões apropriadas.
tr: İzin reddedildi. Uygulamayı uygun izinlerle çalıştırın.

source: Error al copiar o mover archivos. Verifique los permisos y el espacio disponible.
de: Fehler beim Kopieren oder Verschieben von Dateien. Überprüfen Sie die Berechtigungen und den verfügbaren Speicherplatz.
fr: Erreur lors de la copie ou du déplacement de fichiers. Vérifier les autorisations et l'espace disponible.
it: Errore durante la copia o lo spostamento dei file. Verifica le autorizzazioni e lo spazio disponibile.
pt: Erro ao copiar ou mover arquivos. Verifique as permissões e o espaço disponível.
tr: Dosyalar kopyalanırken veya taşınırken hata oluştu. İzinleri ve kullanılabilir alanı kontrol edin.

source: Se produjo un error en los datos proporcionados. Verifique la información ingresada.
de: Bei den angegebenen Daten ist ein Fehler aufgetreten. Bitte überprüfen Sie die eingegebenen Informationen.
fr: Une erreur s'est glissée dans les données fournies. Veuillez vérifier les informations saisies.
it: Si è verificato un errore nei dati forniti. Controlla le informazioni inserite.
pt: Houve um erro nos dados fornecidos. Verifique as informações inseridas.
tr: Sağlanan verilerde bir hata oluştu. Girilen bilgileri doğrulayın.

source: Falta un elemento requerido en los datos. Verifique el formato de la información.
de: Ein erforderliches Element fehlt in den Daten. Überprüfen Sie das Format der Informationen.
fr: Un élément obligatoire manque dans les données. Vérifiez le format de l'information.
it: Nei dati manca un elemento richiesto. Verifica il formato delle informazioni.
pt: Um elemento obrigatório está faltando nos dados. Verifique o formato das informações.
tr: Verilerde gerekli bir öğe eksik. Bilgilerin biçimini kontrol edin.

source: Se intentó acceder a un elemento fuera del rango permitido. Revise la configuración interna.
de: Es wurde versucht, auf ein Element außerhalb des zulässigen Bereichs zuzugreifen. Überprüfen Sie die interne Konfiguration.
fr: Une tentative a été faite pour accéder à un élément en dehors de la plage autorisée. Vérifier la configuration interne.
it: Si è tentato di accedere a un elemento al di fuori dell'intervallo consentito. Controlla la configurazione interna.
pt: Foi feita uma tentativa de acessar um item fora do intervalo permitido. Verifique a configuração interna.
tr: İzin verilen aralığın dışındaki bir öğeye erişilmeye çalışıldı. Dahili yapılandırmayı kontrol edin.

source: No se pudo establecer una conexión. Verifique su conexión a Internet.
de: Eine Verbindung konnte nicht hergestellt werden. Überprüfen Sie Ihre Internetverbindung.
fr: Une connexion n'a pas pu être établie. Vérifiez votre connexion Internet.
it: Non è stato possibile stabilire una connessione. Verifica la connessione a Internet.
pt: Não foi possível estabelecer uma conexão. Verifique sua conexão com a Internet.
tr: Bağlantı kurulamadı. İnternet bağlantınızı kontrol edin.

source: La operación tardó demasiado tiempo en completarse. Inténtelo más tarde.
de: Der Vorgang hat zu lange gedauert, um abgeschlossen zu werden. Bitte versuchen Sie es später noch einmal.
fr: L'opération a duré trop longtemps. Veuillez réessayer plus tard.
it: L'operazione ha richiesto troppo tempo per essere completata. Riprova più tardi.
pt: A operação levou muito tempo para ser concluída. Tente novamente mais tarde.
tr: İşlemin tamamlanması çok uzun sürdü. Lütfen daha sonra tekrar deneyin.

source: Se perdió la conexión con el servidor. Intente reconectarse.
de: Die Verbindung zum Server wurde unterbrochen. Bitte versuchen Sie, die Verbindung wieder herzustellen.
fr: La connexion au serveur a été perdue. Veuillez essayer de vous reconnecter.
it: La connessione al server è stata persa. Prova a riconnetterti.
pt: A conexão com o servidor foi perdida. Tente se conectar novamente.
tr: Sunucuyla bağlantı kesildi. Yeniden bağlanmayı deneyin.

source: Ocurrió un error inesperado: {0}
de: Es ist ein unerwarteter Fehler aufgetreten: {0}
fr: Une erreur inattendue s'est produite : {0}
it: Si è verificato un errore imprevisto: {0}
pt: Ocorreu um erro inesperado: {0}
tr: Beklenmeyen bir hata oluştu: {0}

source: Descargando la actualización, esto puede tardar unos momentos...
de: Das Herunterladen des Updates kann ein paar Augenblicke dauern...
fr: Téléchargement de la mise à jour, cela peut prendre quelques instants...
it: Download dell'aggiornamento in corso. L'operazione potrebbe richiedere alcuni istanti...
pt: Faça o download da atualização, o que pode levar alguns minutos...
tr: Güncelleme indiriliyor, bu işlem birkaç dakika sürebilir...

source: Descarga cancelada.
de: Download abgebrochen.
fr: Téléchargement annulé.
it: Download annullato.
pt: Download cancelado.
tr: İndirme iptal edildi.

source: Extrayendo la actualización...
de: Extrahieren der Aktualisierung...
fr: Extraction de la mise à jour...
it: Estrazione dell'aggiornamento...
pt: Extraindo a atualização...
tr: Güncelleme Ayıklanıyor...

source: Creando el archivo de instalación automática...
de: Erstellen der automatischen Installationsdatei...
fr: Création du fichier d'installation automatique...
it: Creazione del file di installazione automatica...
pt: Criação do arquivo de instalação automática...
tr: Otomatik kurulum dosyası oluşturuluyor...

source: Archivo de actualización creado. La aplicación se reiniciará.
de: Update-Datei erstellt. Die Anwendung wird neu gestartet.
fr: Fichier de mise à jour créé. L'application redémarre.
it: File di aggiornamento creato. L'applicazione sarà riavviata.
pt: Arquivo de atualização criado. O aplicativo será reiniciado.
tr: Güncelleme dosyası oluşturuldu. Uygulama yeniden başlatılacak.

source: Reiniciar ahora
de: Jetzt neu starten
fr: Redémarrer maintenant
it: Riavvia ora
pt: Reiniciar agora
tr: Şimdi yeniden başlat

source: Reiniciando la aplicación...
de: Neustart der Anwendung...
fr: Redémarrer l'application...
it: Riavvio dell'applicazione...
pt: Reiniciar o aplicativo...
tr: Uygulama yeniden başlatılıyor...

source: &Aceptar
de: &Akzeptieren
fr: &Acceptation
it: &Ok
pt: &Aceitar
tr: &Tamam

source: &Sí
de: &Ja
fr: &Oui
it: &Sì
pt: &Sim
tr: &Evet

source: &No
de: &Nein
fr: &Non
pt: &Não
tr: &Hayır

source: WASAPIRecording Versión: {} Creado por: {} Copyright © 2025 Traductores: 🇹🇷 Turco: Umut Korkmaz 🇸🇦 Árabe: moataz geba 🇮🇹 Italiano: Alessio Lenzi 🇻🇳 Vietnamita: Đào Đức Trung
de: WASAPIRecording Version: {} Erstellt von: {} Copyright © 2025 Übersetzer: 🇹🇷 Türkisch: Umut Korkmaz 🇸🇦 Arabisch: moataz geba 🇮🇹 Italienisch: Alessio Lenzi 🇻🇳 Vietnamesisch: Đào Đức Trung
it: WASAPIRecording Versione: {} Creato da: {} Copyright © 2025 Traduttori: 🇹🇷 Turco: Umut Korkmaz 🇸🇦 Arabo: moataz geba 🇮🇹 Italiano: Alessio Lenzi 🇻🇳 Vietnamita: Đào Đức Trung
tr: WASAPIRecording Sürüm: {} Geliştirici: {} Telif hakkı © 2025 Çevirmenler: 🇹🇷 Türkçe: Umut Korkmaz 🇸🇦 Arapça: moataz geba 🇮🇹 İtalyanca: Alessio Lenzi 🇻🇳 Vietnamca: Đào Đức Trung

source: WASAPIRecording Versión: {} Creado por: {} Copyright © 2025 Traductores: 🇹🇷 Turco: Umut Korkmaz 🇸🇦 Árabe: moataz geba
pt: Registro WASAPIR Versão: {} Criado por: {} Direitos autorais © 2025 Tradutores: 🇹🇷 Turco: Umut Korkmaz 🇸🇦 Árabe: moataz geba
